{
  "schedule": [
    {
      "date": "2023-08-30",
      "groups": [
        {
          "time": "Day 1, 2023-08-30 7:00 am",
          "sessions": [
            {
              "name": "Registration",
              "timeStart": "7:00 am",
              "timeEnd": "9:00 am",
              "location": "Windhoek Show Grounds Office",
              "description": "Attendees arrive and check-in. Breakfast is served, providing an opportunity for networking",
              "tracks": ["registration"],
              "id": "1"
            }
          ]
        },
        {
          "time": "Day 1, 2023-08-30 9:00 am",
          "sessions": [
            {
              "name": "Arrival by H.E. Dr Hage Geingob, President of the Republic of Namibia, AU & Namibia Anthems, Mr Ricardo Goagoseb - Director of ceremonies",
              "location": "Arrival by H.E. Dr Hage Geingob, President of the Republic of Namibia, AU & Namibia Anthems, Mr Ricardo Goagoseb - Director of ceremonies",
              "description": "Safety Moment.",
              "speakerNames": ["Mr Ricardo Goagoseb"],
              "timeStart": "9:00 am",
              "timeEnd": "9:10 am",
              "tracks": ["Presentation"],
              "id": "2"
            },
            {
              "name": "Welcoming Remarks & Opening",
              "location": "Makalani Hall",
              "description": "Welcome Remarks & Opening",
              "speakerNames": ["Mr. Zebra Kasete"],
              "timeStart": "9:10 am",
              "timeEnd": "9:20 am",
              "tracks": ["Speech"],
              "id": "3"
            },
            {
              "name": "Remarks",
              "location": "Makalani Hall",
              "description": "Remarks",
              "speakerNames": ["Klaus Endresen"],
              "timeStart": "9:20 am",
              "timeEnd": "9:30 am",
              "tracks": ["Workshop"],
              "id": "4"
            },
            {
              "name": "Remarks: Introduction of the Guest of Honour by the Minister of Mines and Energy",
              "location": "Makalani Hall",
              "description": "Remarks",
              "speakerNames": ["Hon. Tom Alweendo"],
              "timeStart": "9:30 am",
              "timeEnd": "9:40 am",
              "tracks": ["Workshop"],
              "id": "5"
            }
          ]
        },
        {
          "time": "Day 1, 2023-08-30 9:40am",
          "sessions": [
            {
              "name": "Key Note address by H.E. Dr Hage Geingob, President of the Republic of Namibia and official opening of the 2023 Mining Expo and Conference",
              "location": "Makalani Hall",
              "description": "Official opening of the Mining Expo",
              "speakerNames": [""],
              "timeStart": "9:40 am",
              "timeEnd": "10:10 am",
              "tracks": ["Remarks"],
              "id": "6"
            },
            {
              "name": "Vote of thanks by Mr George Botshiwe, 1st Vice President of the Chamber of Mines of Namibia",
              "location": "Makalani Hall",
              "description": "Vote of thanks by Mr George Botshiwe, 1st Vice President of the Chamber of Mines of Namibia",
              "speakerNames": [""],
              "timeStart": "10:10 am",
              "timeEnd": "10:20 am",
              "tracks": ["Remarks"],
              "id": "7"
            },
            {
              "name": "Cutting of the Ribbon and Visiting of the booth by Delegation",
              "location": "Makalani Hall",
              "description": "Cutting of the Ribbon and Visiting of the booth by Delegation",
              "speakerNames": [""],
              "timeStart": "10:20 am",
              "timeEnd": "11:20 am",
              "tracks": ["Presentations"],
              "id": "8"
            },
            {
              "name": "Exhibition Opening",
              "location": "Windhoek Show Grounds",
              "description": "Exhibitor Opens to the general public",
              "speakerNames": [],
              "timeStart": "11:30 am",
              "timeEnd": "onwards",
              "tracks": ["Presentations"],
              "id": "9"
            },
            {
              "name": "Judging of Stands",
              "location": "All Exhibition Halls",
              "description": "Judging of Stands",
              "speakerNames": [],
              "timeStart": "11:30 am",
              "timeEnd": "onwards",
              "tracks": ["Presentations"],
              "id": "10"
            }
          ]
        },
        {
          "time": "Day 1, 2023-08-31 12:30 pm",
          "sessions": [
            {
              "name": "Lunch Break",
              "location": "Jacaranda Hall",
              "description": "Lunch Break",
              "speakerNames": [""],
              "timeStart": "12:30 pm",
              "timeEnd": "14:00 pm",
              "tracks": ["General"],
              "id": "11"
            },
            {
              "name": "Conference Registration",
              "location": "Makalani Hall",
              "description": "Conference Registration",
              "speakerNames": [""],
              "timeStart": "12:30 pm",
              "timeEnd": "14:00 pm",
              "tracks": ["Presentation"],
              "id": "12"
            },
            {
              "name": "Conference Programme",
              "location": "Makalani Hall",
              "description": "Conference Programme",
              "speakerNames": [""],
              "timeStart": "14:00 pm",
              "timeEnd": "17:00 pm",
              "tracks": ["Technology Advancements"],
              "id": "13"
            },
            {
              "name": "Exhibition Closes",
              "location": "All Exhibition Halls",
              "description": "Exhibition Closes",
              "speakerNames": [""],
              "timeStart": "18:00 pm",
              "timeEnd": "",
              "tracks": ["Advancements"],
              "id": "14"
            }
          ]
        },
        {
          "time": "Day 2, 2023-08-31 7:30 am",
          "sessions": [
            {
              "name": "Conference Registration",
              "location": "Makalani Hall",
              "description": "Registration",
              "speakerNames": [],
              "timeStart": "7:30 am",
              "timeEnd": "8:00 am",
              "tracks": ["Registration"],
              "id": "15"
            },
            {
              "name": "Conference Programme",
              "location": "Makalani Hall",
              "description": "Conference Programme",
              "speakerNames": [],
              "timeStart": "8:00 am",
              "timeEnd": "13:00 pm",
              "tracks": ["Conference"],
              "id": "16"
            },
            {
              "name": "Exhibition Opens to the general public",
              "location": "All Exhibition Halls",
              "description": "Exhibition Opens to the general public",
              "speakerNames": [""],
              "timeStart": "8:00 am",
              "timeEnd": "18:00 pm",
              "tracks": ["Presentations"],
              "id": "17"
            }
          ]
        },
        {
          "time": "Day 2, 2023-08-31 10:30 am",
          "sessions": [
            {
              "name": "Lunch Break",
              "location": "Jacaranda Hall",
              "description": "Lunch is served. Participants explore the exhibition area to learn about the latest products and services in the mining sector",
              "speakerNames": [""],
              "timeStart": "12:30 pm",
              "timeEnd": "14:00 pm",
              "tracks": ["General"],
              "id": "18"
            },
            {
              "name": "Closing",
              "location": "All Exhibition Halls",
              "description": "Closing Ceremony. Exhibition closes ",
              "speakerNames": [],
              "timeStart": "18:00 pm",
              "timeEnd": "",
              "tracks": ["Conference"],
              "id": "19"
            }
          ]
        },
        {
          "time": "Day 2, 2023-08-31 18:00",
          "sessions": [
            {
              "name": "Networking Cocktail Function",
              "location": "Wag n Bietjie Hall",
              "description": "Presentation of Awards for the best stand/booth (BY INVITATION ONLY)",
              "speakerNames": [],
              "timeStart": "18:30 pm",
              "timeEnd": "onwards",
              "tracks": ["Conference"],
              "id": "20"
            }
          ]
        }
      ]
    }
  ],

  "speakers": [
    {
      "name": "Hon. Tom Alweendo",
      "profilePic": "/assets/img/speakers/Hon. Tom Alweendo High resolution Official Image.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Minister of Mines & Energy",
      "title": "Minister of Mines & Energy",
      "location": "Everywhere",
      "email": "burt@example.com",
      "phone": "+1-541-754-3010",
      "id": "1"
    },
    {
      "name": "Willy Mertens",
      "profilePic": "/assets/img/speakers/Image_Willy Mertens_Debmarine Namibia CEO_2023.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "CEO - Debmarine Namibia",
      "title": "CEO - Debmarine Namibia",
      "location": "Everywhere",
      "email": "paul@example.com",
      "phone": "+1-541-754-3010",
      "id": "2"
    },
    {
      "name": "Aphary Muyongo",
      "profilePic": "/assets/img/speakers/Aphary Muyongo.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Aphary Muyongo is a Deputy Director and head of the Economic Geology Division at the Geological Survey of Namibia within the Ministry of Mines and Energy. He holds an M.Sc. degree in Applied Geoscience specialising in Exploration and Economic Geology (University of Namibia); a double major B.Sc. degree in Geology and Chemistry (University of Namibia); and a B.Sc.Honours degree (ore deposit stream) from the University of KwaZulu-Natal, RSA. He has over 19 years of work experience including geological mapping and mineral exploration accumulated mainly at the Geological Survey of Namibia and private mineral exploration industry.",
      "title": "Deputy Director of Economic Geology - Geological Survey of Namibia",
      "location": "Everywhere",
      "email": "silas@example.com",
      "phone": "+1-541-754-3010",
      "id": "3"
    },
    {
      "name": "Anthony Viljoen",
      "profilePic": "/assets/img/speakers/Anthony Viljoen_Headshot.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Anthony Viljoen is a seasoned African mining entrepreneur and mining executive. He is a founding shareholder of VM Investment Company (Pty) Ltd, a principal investments and advisory company with a bias towards mining exploration and development. He has been responsible for the establishment and project development of numerous mining projects including, Vanadium, Lithium, Tin, Tantalum, Coal and Gold across Africa. Anthony was a founder and CEO of Lemur Resources (ASX:LMR), an Australian listed company focused on the development of the coal basins for electricity generation in Madagascar, from inception in 2008 until the company was acquired by Bushveld Minerals in 2014.He was a founding shareholder and executive director of London Listed Bushveld Minerals (AIM:BMN), from 2011 until he exited earlier last year (2022), building Bushveld from an exploration company into a producer of 5% of the world’s supply of Vanadium. His current role is as the founder and CEO of London Listed Andrada Mining (AIM:ATM), which is focused on identifying and developing technology metals mines for the energy transition. Under his leadership, the company identified and developed its flagship asset in Namibia, the Uis mine, which contains globally significant quantities of Lithium, Tin and Tantalum.Anthony holds a Bachelor of Business and Agricultural Economics degree, and a Postgraduate qualification in Finance and Banking. He grew up in the mining industry in Africa and has drawn from the wealth of knowledge and experienced network of mining professionals, acquired by his father and late uncle, Richard and Morris Viljoen, who were both pre-eminent Professors of Geology and are renowned for their contributions to the African mining industry and geology in particular. Between them, they cultivated more than a century of exploration and mine development experience",
      "title": "CEO - Andrada Mining",
      "location": "Everywhere",
      "email": "eva@example.com",
      "phone": "+1-541-754-3010",
      "id": "4"
    },
    {
      "name": "Christopher Drysdale",
      "profilePic": "/assets/img/speakers/Christopher Drysdale .webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Mr. Drysdale is an experienced professional with international expertise in the mineral and exploration industry. He currently holds the position of CEO at Antler Gold Inc. (TSX.V:ANTL) and serves as a Director at E-Tech Resources Inc. (TSX.V:REE). With a diverse background and extensive work experience in Namibia and Africa, he actively promotes environmentally conscious practices in the extraction and production of critical minerals necessary for the global energy transition",
      "title": "CEO Antler Gold & Director at E-tech Resources",
      "location": "Everywhere",
      "email": "ellie@example.com",
      "phone": "+1-541-754-3010",
      "id": "5"
    },
    {
      "name": "Gerda Brand",
      "profilePic": "/assets/img/speakers/Gerda Brand 1.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Gerda is a Tax Director and leads the Tax Business Unit of Deloitte in Namibia. She was appointed a Director in 2010 and has over 25 years of tax experience. Gerda is an admitted attorney of the High Court of Namibia. Gerda specialises in all forms of taxation (corporate tax, VAT, PAYE, expat taxes, withholding taxes, transfer pricing) and consults to a portfolio of corporates, listed and medium sized clients, on a wide range of tax issues.Gerda is a member of the Law Society of Namibia, the Bankers Association’s VAT committee and the Institute of Chartered Accountants (ICAN) Tax Committee. She is the editor of Deloitte Tax Newsletter and Quick Tax Guide",
      "title": "Tax Director - Deloitte Namibia",
      "location": "Everywhere",
      "email": "isabella@example.com",
      "phone": "+1-541-754-3010",
      "id": "7"
    },
    {
      "name": "Gosia Lachut",
      "profilePic": "/assets/img/speakers/Gosia Lachut EU.webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "Mrs Gosia Lachut has been posted to the EU Delegation to Namibia as the Deputy Head of Mission/ Head of Political, Press and Information Section, since September 2020. Gosia has been working for the EU since 2003, covering various aspects of the EU external relations, both from the development assistance and political perspective.Her geographic experience ranges from Southern and Eastern Africa, through the Southern Pacific and the Maghreb countries. Originally graduated in economics/finance (Warsaw School of Economics and Université de Tours), she went on to complete Master's degrees in European Studies (College of Europe in Brugge), and International Politics and Security Studies (Université Libre de Bruxelles).",
      "title": "Acting Chargé d'Affaires - European Union",
      "location": "Everywhere",
      "email": "karl@example.com",
      "phone": "+1-541-754-3010",
      "id": "8"
    },
    {
      "name": "John Borshoff",
      "profilePic": "/assets/img/speakers/John Borshoff (2).webp",
      "instagram": "instagram",
      "twitter": "twitter",
      "about": "John is an experienced mining executive and geologist with more than 45 years’ uranium industry experience. He founded Paladin Energy Limited in 1993 and took it from a junior explorer to a multi-mine uranium company worth more than US$5 billion at its peak in the pre-Fukushima era.He was appointed to the role of Managing Director/CEO of Deep Yellow in 2016, aiming to develop the Company into a Tier 1, multi-mine, global uranium producer. He has since built a capable, experienced team with a proven track record and initiated a dual pillar growth strategy of discovery of new deposits and mergers and acquisitions",
      "title": "Managing Director/CEO - Deep Yellow Limited",
      "location": "Everywhere",
      "email": "lionel@example.com",
      "phone": "+1-541-754-3010",
      "id": "9"
    },
    {
      "name": "John Roos",
      "profilePic": "/assets/img/speakers/John Roos.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "2nd Vice-President - CoM",
      "title": "2nd Vice-President - CoM",
      "location": "Everywhere",
      "email": "molly@example.com",
      "phone": "+1-541-754-3010",
      "id": "10"
    },
    {
      "name": "Julian Grieve",
      "profilePic": "/assets/img/speakers/Julian Grieve.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Julian has been in investment banking for the past 14 years, having started his career in mining finance and having gained exposure to oil & gas over the years. His academic background is in pure mathematics, chemistry and economics, and he is a CFA charter holder.Julian has worked across commodities and jurisdictions, from project finance for mineral sands in Kenya to acquisition finance for platinum group metals in Canada. He has led debt advisory and empowerment transactions, having raised capital for African investments from North America, Europe, Asia, Africa and Australia.He currently co-heads the Resources Sector Solutions team in RMB’s drive to prioritise client needs and ensure that the right advice, and considered holistic solutions, are consistently delivered.",
      "title": "Co-head Resources Sector Solutions - RMB",
      "location": "Everywhere",
      "email": "paul@example.com",
      "phone": "+1-541-754-3010",
      "id": "11"
    },
    {
      "name": "Kirsty Liddicoat",
      "profilePic": "/assets/img/speakers/Kirsty-30.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Kirsty is the Chief Operating Officer for Northern Graphite. Over 20 years’ in the mining industry has seen her career cover strategy, mine and project management, mine planning, engineering, geoscience and exploration in oil sands, coal, gold, iron ore, bauxite and copper-gold. Kirsty’s been instrumental in changing the way geoscience is undertaken in coal through the application of new technologies and methodologies.Having worked in remote and regional areas Kirsty is well accustomed to working with people from a wide variety of backgrounds in demanding conditions. Her dedication to the progression of inclusion and diversity in the industry has developed into a passion for supporting women through their careers.Kirsty has a Bachelor of Science in Geology (Honors), a Masters in Mining Engineering and a Masters in Business Administration. In 2018 Kirsty received a Chief Executive Women scholarship to attend INSEAD, in 2012 she received the Women in Leadership Australia Scholarship designed to develop high potential female leaders and in 2013 Kirsty was recognized in the inaugural 100 Global most Inspirational Women in Mining published by Women in Mining United Kingdom.With a track record in team leadership, mine development, mine planning and systems establishment, Kirsty has been instrumental in changing the culture of two major sites in order to improve safety and increase productivity.Kirsty has a love of the outdoors and all associated activities, has hiked to Everest Base Camp and is known to do anything to get a thrill - not limited to rock climbing and jumping out of planes. She travels extensively and enjoys time with family and friends.",
      "title": "COO - Northen Graphite",
      "location": "Everywhere",
      "email": "rachel@example.com",
      "phone": "+1-541-754-3010",
      "id": "12"
    },
    {
      "name": "Olavi Hangula",
      "profilePic": "/assets/img/speakers/Olavi Hangula.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Olavi Hangula, Mining and Energy Relations Manager at RMB Namibia, specializes in building and nurturing relationships within the mining and energy sector. Leveraging his investment banking background, Olavi assists clients in identifying opportunities and handling complex financial transactions. With a multidisciplinary perspective, he approaches challenges creatively to develop impactful solutions.Previously, Olavi worked as an Investment Banking Analyst at Jefferies in London, where he played a vital role in supporting debt capital raise transactions for renewable energy projects, including solar, battery energy storage, and wind farm initiatives within the Power, Utilities, and Infrastructure sectors. His skill in recognizing opportunities and analyzing market trends contributed to the successful execution of these significant financial transactions.In addition to his finance experience, Olavi gained practical insight into Namibian Private Equity, deepening his understanding of challenges in emerging markets. Holding a degree in International Relations with a Minor in Business from the University of Rochester, New York, Olavi is dedicated to driving positive change and collaborative achievements.",
      "title": "Relationship Manager (Mining & Energy) - RMB Namibia",
      "location": "Everywhere",
      "email": "ted@example.com",
      "phone": "+1-541-754-3010",
      "id": "13"
    },
    {
      "name": "Barcelona Tsauses",
      "profilePic": "/assets/img/speakers/Barcelona Tsauses.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Director - Sustainability and Business Transformation and Chairman - Chamber Safety Committee",
      "title": "As the appointed Director of Business Transformation, Barcelona brings a wealth of experience to her role, having designed and commissioned various plant units across her career, including the state-of-the-art Sulphuric Acid Plant at the Dundee Tsumeb Smelter. Barcelona is a Chemical Engineer and holds an Executive Management MBA from the University of Cape Town, and serves at an industry level through her Chairmanship of the Chamber Safety Committee and COVID-19 Task Team, and is a founding member of the Women in Mining Association.",
      "location": "Everywhere",
      "email": "ted@example.com",
      "phone": "+1-541-754-3010",
      "id": "13"
    },
    {
      "name": "Erasmus Shivolo",
      "profilePic": "/assets/img/speakers/Erasmus Shivolo.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Mr. Shivolo is a Materials Science Engineer. He studied at the Colorado School of Mines and New Mexico Institute of Mining & Technology, USA. An employee at the Ministry of Mines and Energy since 1996, Mr. Shivolo has served in the following positions: Inspector of Mine Machinery, Chief Engineer, Deputy Director of Mines, Director of Mines, Mining Commissioner and currently holds the position of Deputy Executive Director - Department of Mines. Mr. Shivolo has also served on different boards and Committees, and has been involved in the development of several government policies and strategies as well as negotiations, representing and advancing the interest of the Government of the Republic of Namibia.",
      "title": "Deputy Executive Director of Mines - Ministry of Mines and Energy",
      "location": "Everywhere",
      "email": "ted@example.com",
      "phone": "+1-541-754-3010",
      "id": "13"
    },
    {
      "name": "Sheron Kaviua",
      "profilePic": "/assets/img/speakers/S Kaviua_Pic.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Vice President Operations - Rosh Pinah Zinc Mine",
      "title": "Vice President Operations - Rosh Pinah Zinc Mine",
      "location": "Everywhere",
      "email": "ted@example.com",
      "phone": "+1-541-754-3010",
      "id": "13"
    },
    {
      "name": "Salo Aleksi",
      "profilePic": "/assets/img/speakers/salo aleksi 2021.webp",
      "instagram": "ionicframework",
      "twitter": "ionicframework",
      "about": "Team Manager, Mineral Potential Research - Geological Survey of Finland",
      "title": "Team Manager, Mineral Potential Research - Geological Survey of Finland",
      "location": "Everywhere",
      "email": "ted@example.com",
      "phone": "+1-541-754-3010",
      "id": "14"
    }
  ],
  "exhibitors": [
    {
      "name": "Namibian Companies & Other Chamber Members",
      "profilePic": "/assets/img/speakers/b1.png",
      "twitter": "ionicframework",
      "about": "Peter Shimbangu is a world renown environmentalist",
      "title": "President",
      "location": "Everywhere",
      "email": "burt@example.com",
      "phone": "+1-541-754-3010",
      "id": "1"
    }
  ],

  "map": [
    {
      "name": "Windhoek",
      "lat": 22.5840,
      "lng": 17.0895,
      "center": true
    },
    {
      "name": "Ionic HQ",
      "lat": 43.074395,
      "lng": -89.381056
    },
    {
      "name": "Afterparty - Brocach Irish Pub",
      "lat": 43.07336,
      "lng": -89.38335
    }
  ],

  "tracks": [
    {
      "name": "Services",
      "icon": "cog"
    },
    {
      "name": "Workshop",
      "icon": "construct"
    },
    {
      "name": "Communication",
      "icon": "call"
    },
    {
      "name": "Navigation",
      "icon": "compass"
    }
  ]
}
