{"schedule":[{"date":"2016-10-20","groups":[{"time":"09:00","sessions":[{"name":"Advanced JavaScript: Foundations","location":"CoreJS","description":"In this one-day intensive course, we will dive deep into core mechanisms of the JS language, probably more than you ever have before. Our goal is to not merely understand what these things do, but how and why. We will cover: • nested lexical scope • hoisting • closures • modules • 'this' keyword • common oo patterns • object prototypes • delegation vs inheritance","speakerNames":["Kyle Simpson"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"React.js Hands-on workshop","location":"React.JS","description":"SKILL LEVEL: INTERMEDIATE \r\nPREREQUISITES: Working knowledge of JavaScript. \r\nTICKET MUST BE PURCHASED SPECIFICALLY FOR THIS WORKSHOP IN ADDITION TO MAIN CONFERENCE TICKET.\r\n\r\nReact.js is a view library from Facecbook for building performant user-interfaces in JavaScript. In this session, we'll explore React.js and understand why it's a great step forward for building complex UI's that run fast. We'll code up an example web application using React.js and step through the basics of using the library while discussing concepts like the virtual DOM and components.\r\n\r\nThis is a HAND-ON WORKSHOP, INTRODUCTORY LEVEL. Please come with a laptop, and if possible, with the software needed pre-installed (Instructions below). We'll cover these topics - both in code and in discussion format, and do as many as we can in the time alloted:\r\n\r\nReact components\r\nLifecycle\r\nProperties\r\nState\r\nUsing React-Bootstrap components\r\nSignaling & Messaging between Component\r\nHandling Events\r\nAll coding done in ES6 style\r\nModern React application structure, setup, and build\r\nWriting tests\r\nReact Router\r\nDiscussion of Flux architecture\r\nREST/Network ops within React\r\nReact architecture\r\nComponent composition\r\nDiscussion of Redux and Functional Web Architecture (time permitting!)","speakerNames":["Andrew Smith","Taggart Bowen-Gaddy"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"AngularJS 2 and TypeScript Workshop","location":"AngularJS","description":"SKILL LEVEL: INTERMEDIATE\r\nPREREQUISITES: Working knowledge of JavaScript.\r\nTICKET MUST BE PURCHASED SPECIFICALLY FOR THIS WORKSHOP IN ADDITION TO MAIN CONFERENCE TICKET.\r\n\r\nThis is a hands-on workshop, you will need your laptop. Workshop instructions will be sent before the event.\r\n\r\nAngularJS is the incredibly popular framework for building single-page web applications. Version 2.0 is a major leap from the 1.x version designed to address shortcomings in the original 5+ year old framework and to embrace modern browsers and language features. It is being written using TypeScript, a superset of JavaScript that allows you to build code using next generation features and compile it to JavaScript that will run on current browsers. In this session Jeremy Likness goes hands-on to show you how to set up your environment and build your first application while teaching you about the advantages of the framework and language based on his years of in-the-field experience architecting enterprise Angular applications.","speakerNames":["Jeremy Likness"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"Practically functional programming","location":"HTML5/CSS3/Web","description":"\r\nFunctional programming is all the rage these days, but our codebases, libraries, and built-in methods are predominately Object-Oriented. Using OO syntax with functional constructs, we can write in a style compatible with either paradigm and enjoy the benefits of both.","speakerNames":["Brian Lonsdorf"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"Animating the User Interface: Designing for Motion","location":"Design","description":"From transitions to loaders, user interfaces are coming alive with motion like we've never seen before. Animation, or “motion design,” has become an essential part of the designer’s toolkit for expressing fundamental interaction design principles. In this workshop, the instructor will show how the aims of interaction design are fulfilled through animation and will discuss what to consider when using animation in your own designs. Through discussion and hands-on implementation, attendees will learn to design and prototype animation using tools like Keynote, Principle, Pixate, or Invision.","speakerNames":["Angie Terrell"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"Up and Running with Ionic v2","location":"Mobile General","description":"In this workshop you will be introduced to the Ionic v2 framework, a powerful hybrid mobile solution. Built atop of Angular 2 and Apache Cordova, this framework gives developers an incredibly powerful set of mobile components to create app store-ready apps. ","speakerNames":["Mike Hartington"],"timeStart":"09:00 AM","timeEnd":"10:00 AM","tracks":["Workshop"],"start":"09:00"},{"name":"Thinking in Swift for iOS","location":"iOS","description":"This fast-paced workshop shows you how to take advantage of Swift features to write more robust code that is easier to reason about. We’ll spend a good part of the day looking at functional programming and playing with map, filter, reduce, and flatmap but we will also create instances of classes, structs, and enums. We’ll explore how your iOS app architecture may change when you embrace idiomatic Swift.","speakerNames":["Daniel Steinberg"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"ES6 (and beyond) Workshop","location":"Android","description":"The EcmaScript standard is now on a yearly release cycle. With ES6 complete and ES2016 ratified, we have a ton of awesome new features to use in our daily software development. In this training, we'll learn about the features you're likely to use and benefit from on a day-to-day basis. In the afternoon, we'll take an existing application and update it to leverage these features using with modern tools like Babel. My goal is that after this training, you'll be able to go back to your projects and add these tools so you can write ES.next code today.","speakerNames":["Kent C. Dodds"],"timeStart":"09:00 AM","timeEnd":"13:00 PM","tracks":["Workshop"],"start":"09:00"},{"name":"IOS in the Enterprise: App distribution and other advanced topics","location":"Misc","description":"The enterprise environment is different than a commercial or consumer facing development effort. In this intermediate level workshop workshop, we'll cover these topics and take a deep dive into the challenges facing enterprise app developers: Monitoring the app in the field, Enterprise UX concerns, Privacy concerns, APIs and capabilities you'll only use in the enterprise, Enterprise deployment walled garden, Advanced problem solving for application design and performance","speakerNames":["Carol Shepherd"],"timeStart":"09:00 AM","timeEnd":"17:00 PM","tracks":["Workshop"],"start":"09:00"}]}]},{"date":"2016-10-21","groups":[{"time":"09:00","sessions":[{"name":"Crazy and Focused (Keynote in Ballroom ABE)","location":"CoreJS","description":"So much of the time we focus on what we do and how we do it.\r\n\r\nWe read books on coding, we come to conferences, we download open source and sample code, we read blogs and listen to podcasts.\r\n\r\nDuring this session we'll explore why we do what we do and for whom. Whether you're inspired or depressed by this talk, you will think differently the next time you open Xcode and type Command-Shift-N and you'll pause before you upload your next app to the app store. Uploading is when you sign your name on your work.","speakerNames":["Daniel Steinberg"],"timeStart":"09:00 AM","timeEnd":"10:00 AM","tracks":[null],"start":"09:00"}]},{"time":"10:00","sessions":[{"name":"Break & Rasberry Pi Demo (IoT Lounge)","location":"Foyer","description":"This is a quick overview of using a Raspberry Pi for IoT devices. This session will consist of deploying Windows 10 IoT Core to a Raspberry Pi, connecting sensors to a breadboard, and development tools such as using Visual Studio and Azure Streaming Analytics. The main demo will contain a connected weather station that sends temperature data to Power BI for real-time graphs!","speakerNames":["Kristin Ottofy"],"timeStart":"10:00 AM","timeEnd":"10:10 AM","tracks":["IoT Lounge"],"start":"10:00"}]},{"time":"10:10","sessions":[{"name":"Prototype to Production - Ember to the Rescue","location":"CoreJS","description":"Looking at the expanse of developing a new product there are hundreds of small mechanisms that need to be in place as you take an idea from prototype to production.  This talk is a look at using Ember to race up the canyon walls to the plateau of maintaining a production application.  Aside from developing a maintainable, useful, and working application, the development team will need to think about the following: build systems and deployment, wireframes to components, simultaneous API and client development, feature spikes with 3rd party libraries, and post-launch maintenance and education.  While examining two start-up projects, I will explore these topics and how Ember helps to provide streamlined solutions.","speakerNames":["Todd Gandee"],"timeStart":"10:10 AM","timeEnd":"11:00 AM","tracks":["Core JavaScript & Frameworks"],"start":"10:10"},{"name":"Introduction to React.JS","location":"React.JS","description":"React.js is a view library from Facebook for building performant user-interfaces in JavaScript. In this session, we'll explore React.js and understand why it's a great step forward for building complex UI's that run fast. We'll code up an example web application using React.js and step through the basics of using the library while discussing concepts like the virtual DOM and components.","speakerNames":["Andrew Smith","Taggart Bowen-Gaddy"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["React.JS"],"start":"10:10"},{"name":"Introduction to Angular2","location":"AngularJS","description":"AngularJS is the incredibly popular framework for building single-page web applications. Version 2.0 is a major leap from the 1.x version designed to address shortcomings in the original 5+ year old framework and to embrace modern browsers and language features. It is being written using TypeScript, a superset of JavaScript that allows you to build code using next generation features and compile it to JavaScript that will run on current browsers","speakerNames":["Jeremy Likness"],"timeStart":"10:10 AM","timeEnd":"11:00 AM","tracks":["AngularJS"],"start":"10:10"},{"name":"Fixing poor UX and performance","location":"HTML5/CSS3/Web","description":"Everyone knows fast sites provide a better UX and have happy users which generate more revenue. But since there are literally hundreds of issues that could be slowing down your pages, How do you figure out (and fix) the ones that are hurting your business most?\r\n\r\nUsing data from the Top IR200 retail sites, Billy will show attendees how to:\r\n\r\n-Gather historical user data via RUM\r\n-Correlate load times with conversions\r\n-Determine which pages in your site are most impacting your business goals.\r\n-Show the top 10 issues that create the biggest bounce rates on the top retail sites on the web.\r\n\r\nNo doubt you’ve encountered scores of lists outlining the top performance issues faced by sites. Unlike those lists, this list is grounded in a study of revenue/business impact. Using this approach, you can focus on fixing the performance defects that are hurting you most on the pages that matter the most.\r\n","speakerNames":["Billy Hoffman"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Web / HTML / CSS"],"start":"10:10"},{"name":"Let's Get Animated!","location":"Design","description":"Add excitement and user interaction with client-side SVG animations! Get the low-down and make your own SVG animation through this lecture. You'll walk out with confidence towards implementing web animations in your future projects! ","speakerNames":["Tamil Periasamy"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Design & UI & UX"],"start":"10:10"},{"name":"Pulling Up Your Legacy App by its Bootstraps","location":"PHP","description":"Your mission, should you choose to accept it, is to support an application built on an older framework. Refactoring isn't an easy option. The code is untested and nowhere near best practices or standards. In this session, we'll talk about strategies to incorporate modern PHP coding practices to add features and functionality and retiring the older code in pieces. We'll review specific examples and code from a real project where we bootstrapped a legacy application that needed a lot of help to become useful to its users and simpler for developers to maintain. We'll talk about strategies to leave the existing code in place until the new code is ready to replace it in whole or in pieces.","speakerNames":["Emily Stamey"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["PHP"],"start":"10:10"},{"name":"ReactNative - Under the hood","location":"Mobile General","description":"ReactNative is a way to create native applications for iOS, Android and Windows devices in JavaScript. In this session, we will look under the covers at the technology that enables ReactNative to drive native user interface components. We will look at a typical developer workflow and the way ReactNative is tied to developer tools. We will round it off with ways to deliver updates to your app without needing to submit updates to the app store.  ","speakerNames":["Parashuram"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["General Mobile: Design, Tools, Testing"],"start":"10:10"},{"name":"Diving into Swift for iOS","location":"iOS","description":"A great intro for those looking to start their journey developing IOS apps using Swift. Using the latest version of Swift we will cover the basics of developing IOS apps.","speakerNames":["Shawn Johnson"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["iOS"],"start":"10:10"},{"name":"Introduction to npm as a Build Tool","location":"Node.JS","description":"Grunt and Gulp are the heavyweights in the JavaScript build tool landscape. These tools can automate almost anything you find yourself doing repeatedly in a project, from minifying and concatenating source files, to running tests or compiling code. But the question is, do you need them? npm’s script directive can do everything that these build tools can, more succinctly, more elegantly, with less package dependencies and less maintenance overhead. In this session I will discuss what npm is capable of as a build tool.","speakerNames":["Jennifer Bland"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Node.JS / Server-side JS"],"start":"10:10"},{"name":"What’s new in Android!","location":"Android","description":"Android N, now known as Nougat, was announced this past spring at Google IO 2016.  Drop in to hear a rundown of all the new and exciting features that you as a developer can take advantage of in the new Nougat release.  From the new split window feature to Java 8 feature support, there is some exciting topics to cover.  We will also cover the latest in build tools: Android Studio, Jack and Jill, and Gradle plugins.  ","speakerNames":["Douglas Knudsen"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Android"],"start":"10:10"},{"name":"aqueduct: A server-side framework in Dart","location":"Misc","description":"A look at the Dart programming language and its new server-side framework, aqueduct. This talk will introduce the fundamentals of the Dart programming language and the tools and knowledge necessary to immediately get started building web server applications in aqueduct.\r\n","speakerNames":["Joe Conway"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["JavaScript Practices"],"start":"10:10"}]},{"time":"11:10","sessions":[{"name":"Break & Photon Board Demo (IoT Lounge)","location":"Foyer","description":"This is a quick overview of using a Photon board for IoT devices. This session will consist of tools and resources for getting started with the Photon board and will demo a connected weather station with code written in Node.js. Come watch as we collect temperature data and stream it into Power BI for real-time graphs!","speakerNames":["Kristin Ottofy"],"timeStart":"11:10 AM","timeEnd":"11:20 AM","tracks":["IoT Lounge"],"start":"11:10"}]},{"time":"11:20","sessions":[{"name":"Composition vs. inheritance","location":"CoreJS","description":"A look at the benefits of functional composition and factory functions vs. traditional inheritance.","speakerNames":["Dylan Schiemann"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Core JavaScript & Frameworks"],"start":"11:20"},{"name":"Navigating the React Ecosystem","location":"React.JS","description":"Let’s walk through the tools that surround React and learn which you should prioritize learning first.","speakerNames":["Ben Ilegbodu"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["React.JS"],"start":"11:20"},{"name":"Refactoring AngularJS Applications","location":"AngularJS","description":"AngularJS applications are often rushed into production with little consideration for long term support or maintainability. This session will discuss strategies for refactoring Angular 1.x applications to make them easier to support over the application's service life.","speakerNames":["Corinna Cohn"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["AngularJS"],"start":"11:20"},{"name":"Developing Web Applications: Standards, Best Practices and Tools","location":"HTML5/CSS3/Web","description":"Web developers have a range of tools and choices available to create solutions for the continuum of browsers and devices. Responsive web design, microservices, security, HTML5 video, HTTP/2, containers, and web performance are some of the pertinent topics when developing web applications. This session will cover web industry standards, best practices, and frameworks related to these and other emerging web technologies.","speakerNames":["Ian Moraes"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Web / HTML / CSS"],"start":"11:20"},{"name":"UX patterns for developers","location":"Design","description":"Are you willing to go the extra mile to make your UX shiny and joyful?\r\nMost of us developers underestimate the importance of the Human-Computer Interaction.\r\n\r\nJoin this talk for developer-friendly UX patterns that you can start using in your everyday code.","speakerNames":["Nicole Saidy","Jad Joubran"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Design & UI & UX"],"start":"11:20"},{"name":"PHP OOP: An Object Oriented Programming Primer","location":"PHP","description":"Whether you are a brand new developer or an experienced coder - the PHP object model can hold some mysteries that are worth exploring.  This session will briefly cover the basics of working with Objects in PHP, then dive quickly through inheritance, abstracts, interfaces, traits, late static binding, magic methods, namespaces and maybe even reflection.  It’s a lot to cover to make sure to show up with your eyes open and ready to move quickly!","speakerNames":["Eli White"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["PHP"],"start":"11:20"},{"name":"Ionic 2: A new way to do mobile","location":"Mobile General","description":"Ionic has revolutionized the way web developers make the transition mobile development, but there’s always room to improve and make the lives of new app developers easier. With Ionic 2, we’ve improved upon much of what made Ionic 1 great, while also keeping things simple and reducing the fatigue that developers can feel when learning a new tool.","speakerNames":["Mike Hartington"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"11:20"},{"name":"Swift Memory Management","location":"iOS","description":"Memory management in Swift is fairly abstracted away from you as a developer and it’s easy to build iOS apps without an understanding of it… until something goes wrong.  This can result in unexpected behavior, unclear error messages, lost data and crashes.  Even a basic understanding of memory management can go a long way, making it easy to prevent these issues in the first place, understand what when wrong when they do occur and know how fix them.","speakerNames":["Marcus Smith"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["iOS"],"start":"11:20"},{"name":"Electron: Building Desktop Apps","location":"Node.JS","description":"With Github's Electron, it is now possible to build Mac, Windows, and Linux desktop applications using Web-standard technologies. Now we can leverage our HTML/CSS/Javascript skills to create cross-platform applications. Join us as we explore setting up, building and deploying a simple desktop app using Electron.","speakerNames":["Leif Wells"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Node.JS / Server-side JS"],"start":"11:20"},{"name":"Gradle Recipes for Android","location":"Android","description":"Android applications no longer use Ant or IDE builds. The new build mechanism is based on Gradle, the popular build tool from the Groovy ecosystem. This talk will introduce Gradle to Android developers and show how easy it is to integrate into Android projects.\r\n\r\nThe latest version of the Android Studio IDE will be used to develop applications. Topics will include using the Android plugin for Gradle, adding dependencies and alternate repositories, creating custom tasks, implementing both unit and integration tests, using alternative build types, product flavors and variants, and more.","speakerNames":["Ken Kousen"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Android"],"start":"11:20"},{"name":"Building non trivial things with WebAssembly","location":"Misc","description":"We'll learn the history of how WebAssembly came to be, the goals it aims to solve, and get familiar with the existing tool chain for writing apps with WebAssembly.","speakerNames":["Nick Larsen"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["JavaScript Practices"],"start":"11:20"}]},{"time":"12:20","sessions":[{"name":"human.lunch()","location":"Foyer","description":"","speakerNames":[],"timeStart":"12:20 PM","timeEnd":"13:20 PM","tracks":[null],"start":"12:20"}]},{"time":"13:20","sessions":[{"name":"Oh Composable World!","location":"CoreJS","description":"The biggest sources of code complexity are state & control flow. Loops, conditionals, try/catch blocks, callbacks, & mutable variable assignment is one way to ensure such complexity. By contrast, if we have a composable set of pieces that plug together, we can “dot chain” a single expression for which our data flows through. We’ll examine techniques from functional programming, borrow some moves from OO, and write blocks of dead-simple to understand code.","speakerNames":["Brian Lonsdorf"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Core JavaScript & Frameworks"],"start":"13:20"},{"name":"Making Designers Happy with React","location":"React.JS","description":"React has enabled Frontend developers to become better JavaScript developers. But better JavaScript creates a tougher environment for Designers. Find out a few ways we empowered our Design to stop writing jQuery and finally start writing React Components.\r\n\r\n","speakerNames":["Brian Douglas"],"timeStart":"01:20 PM","timeEnd":"14:00 PM","tracks":["React.JS"],"start":"13:20"},{"name":"Angular 1.x Performance Pitfalls","location":"AngularJS","description":"Performance and memory can quickly get away from you in JavaScript, and some features in Angular 1 can exacerbate the problem. We will discuss some basic causes for performance drains and memory leaks in JavaScript and some specific misuses of Angular that run into them.","speakerNames":["K. Devin McIntyre"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["AngularJS"],"start":"13:20"},{"name":"Thinking Differently About Web Performance","location":"HTML5/CSS3/Web","description":"Performance is vital to success on the web, but it is often thought of in terms of load time rather than what happens when a user actually starts using your web app. In this talk, we’ll take an in-depth look into the tools and techniques you can use from right within your browser to help your web app match its native counterparts. We’ll walk through several live demos of real-world performance issues and their solutions, from CPU bottlenecks to page crashing memory leaks. You’ll walk away better understanding the tools at your disposal and how to apply those to up the game of your current or upcoming projects.","speakerNames":["James Simpson"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Web / HTML / CSS"],"start":"13:20"},{"name":"Engaging Engineering Teams in Design","location":"Design","description":"Frequently, designers and engineers tend to run in their own circles and speak their own distinct languages. Interactions between the 2 teams tend to follow a prescribed, limited path: design creates mocks for a planned UI change, engineering implements the mocks and deploys the new UI to the customer. But experience has shown that keeping design and engineering engaged throughout the product development cycle leads to far more coherent, impactful result. Josh Teague (lead designer at FullStory) and Stephanie Brubaker (senior engineer at FullStory) will be sharing lessons from their own experience on how design and engineering teams can work together to create breakthrough products.","speakerNames":["Josh Teague","Stephanie Brubaker"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Design & UI & UX"],"start":"13:20"},{"name":"Contract Driven Development","location":"PHP","description":"Have you ever used a web-based API that was poorly designed and inconsistent?  Have you found gaps between the documentation and implementation?  At Patientco, we have successfully implemented a Contract Driven Design methodology for APIs.  Swagger is used to design RESTful endpoints before a line of code is written and the specification, documentation, and code are kept in sync through automated testing and deployment.","speakerNames":["Chris Church"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["PHP"],"start":"13:20"},{"name":"Practical Performance Tips to Make Your Cross Platform Mobile Apps Faster","location":"Mobile General","description":"Apache Cordova is one of the most popular frameworks for cross-platform mobile development. Web developers can build apps for iOS, Android, and Windows based on the same frameworks they use for the Web by using a shared codebase. However, the methods for improving mobile app performance can be different from those web developers use for web apps. Doris Chen outlines what impacts “native performance” and explains how the startup time, as well as the overhead of resume, memory, communication, and the Web, can all contribute to the performance of Cordova apps. To build Cordova apps that perform well, it’s important to understand how to avoid common pitfalls and how to use the technologies in the most efficient ways. Doris introduces tools for performance tests and demonstrates how to measure mobile app performance by using diagnostic tools for different platforms. Doris also shares practical tips for building faster Cordova apps by exploring Document Object Model (DOM) complexity, animation techniques, and memory management.","speakerNames":["Dr. Doris Chen"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"13:20"},{"name":"Enhancing Your Workflow with Xcode Source Editor Extensions","location":"iOS","description":"Developers are constantly refining their workflow in order to master their craft. There is a plethora of tools available that can help bootstrap a project, increase efficiency, or simply make developers happy. Let’s explore the newly introduced Xcode Source Editor Extensions; an Application Extension that gives developers the power to create custom actions in Xcode’s Editor menu.","speakerNames":["Jesse Black"],"timeStart":"01:20 PM","timeEnd":"14:00 PM","tracks":["iOS"],"start":"13:20"},{"name":"I have a NoSQL toaster","location":"Node.JS","description":"NoSQL is a catch-all term that covers a lot of different types of data storage. Is it really helpful to group them together by one thing they don't have? Think about it like this: my toaster is as much NoSQL as any database! So, how can we make more sense of this new breed of database management systems?","speakerNames":["Matthew Groves"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Node.JS / Server-side JS"],"start":"13:20"},{"name":"Advanced Android: Fragments & Services","location":"Android","description":"Topics in this session will include an in-depth discussion of fragments, as well as services, notifications, and the action bar.\r\n\r\nFragments are fundamental to Android applications, but their implementation can get complicated. We'll look at simple ones, like the preferences fragment, then move to dialogs, and finally a complete summary/detail flow.","speakerNames":["Ken Kousen"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Android"],"start":"13:20"},{"name":"Rust for Node developers","location":"Misc","description":"Rust is a programming language from Mozilla that combines strong compile-time correctness guarantees with fast performance and it plays nice with ctypes! Come learn how you can call Rust functions from Node.js code and finally say goodbye to hacking C!\r\nThere will be a quick intro to Rust, but more an appetizer than anything else; then explanation about how Rust and Node.js can work together, and at the end a few demos to take advantages from Rust in Node.js","speakerNames":["Giovanny Gongora"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["JavaScript Practices"],"start":"13:20"}]},{"time":"14:20","sessions":[{"name":"Break & Sensors (IoT Lounge)","location":"Foyer","description":"","speakerNames":["Kristin Ottofy"],"timeStart":"02:20 PM","timeEnd":"14:30 PM","tracks":["IoT Lounge"],"start":"14:20"}]},{"time":"14:30","sessions":[{"name":"JavaScript error reporting and why we can't have nice things","location":"CoreJS","description":"Wouldn't it be nice if, instead of relying on users to report bugs, your web app automatically did it for you? In this talk, learn how to collect JS errors from your web apps – how to do it, why it's hard, and why you should consider 3rd-party libraries and tools to do it for you.","speakerNames":["Ben Vinegar"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Core JavaScript & Frameworks"],"start":"14:30"},{"name":"Sane React Testing","location":"React.JS","description":"In this talk, you'll learn about the three main inputs to React components that you commonly need to deal with when unit testing and how to properly isolate these concerns in your unit tests. You'll walk away with what you need to know to build a solid, maintainable test suit for your React applications and libraries.","speakerNames":["Kent C. Dodds"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["React.JS"],"start":"14:30"},{"name":"Angular Architectures: A roadmap for the hearty traveller","location":"AngularJS","description":"There is no doubt that Angular is now mainstream. That made it easier for you to convince the powers-that-be to let you select Angular for your project. You've done a small but successful POC and now your 'big' project has been green lighted to kick off next month. Your team is jazzed but as you start to plan out the real work, you begin to realize that there are many aspects inherrent to large Angular projects that have no 'out of the box' answers.\r\n\r\nStack overflow can only contribute 'it depends' answers that leave you more confused than before you read them. And now the panic starts to seep in, killing your buzz. Never fear! In this session, we will explore a variety of ways to architect your project and structure your code. We will look at the pros and cons of each option and discuss when trigger points for choosing each.","speakerNames":["Peter Pavlovich"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["AngularJS"],"start":"14:30"},{"name":"Whirlwind Tour of HTML5","location":"HTML5/CSS3/Web","description":"HTML and JavaScript have come a long way since the dark days of IE's domination of the browser market. In this talk, Jordan Kasper will introduce you to some of the exciting new features in HTML5 that we can implement right now in our applications! We'll look at capturing the user's camera data, accessing their location, reading the file system, native drag and drop, and even vibrating their phone! Join us for a session of fun demos and new experiences. Attendees will walk away from this session with some ideas about how to make your web applications even more amazing with these new APIs.","speakerNames":["Jordan Kasper"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Web / HTML / CSS"],"start":"14:30"},{"name":"Bridging the designer-developer gap","location":"Design","description":"It’s no surprise that designers and developers tend to be separate teams. Designers are all about creativity and art; developers are about logic and effectiveness. Yet what we don’t realize is that both of them have one trait in common: to solve problems. Both have to work together to make their product work.\r\nLearn how to better communicate with designers through tips and tricks to help you see things from a designer’s perspective, for less headaches & smarter digital products.","speakerNames":["Nicole Saidy"],"timeStart":"02:30 PM","timeEnd":"15:20 PM","tracks":["Design & UI & UX"],"start":"14:30"},{"name":"API Security: Slowing down the hackers","location":"PHP","description":"APIs are the backbone of modern web applications. Whether they be used as a access point for AJAX queries, mobile apps, 3rd party integrations or just general data feeds, your applications’ API often needs the ability to access everything. Securing the API consequently is essential to the security of your application. This talk will cover the various types of APIs common in web applications, the security issues relevant with the various API types and methods for securing your APIs, and slowing down the hackers.","speakerNames":["Anthony Green"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["PHP"],"start":"14:30"},{"name":"Ignite Your App Development With NativeScript and Firebase","location":"Mobile General","description":"You've heard about the great enhancements to Firebase, as announced at Google.io, and you're curious about how to leverage them in a mobile app? This session will reveal how you can use NativeScript with Angular 2 to build a cross-platform mobile app that can be updated in realtime. Set your mobile development on fire with Firebase and NativeScript!","speakerNames":["Jen Looper"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"14:30"},{"name":"Level Up Your Game With TravisCI: From Zero To Hero In 45 Minutes","location":"iOS","description":"TravisCI, Xcode Bots, Fastlane, TestFlight, HockeyApp are only a few of the many tools that are available and highly used to optimize workflows and improve your product. But where do you start? \"Level Up Your Game With TravisCI: From Zero To Hero In 45 Minutes\" helps you jump start into CI with your iOS projects. No matter if you have never heard about CI before or if you only want to refine your tools.","speakerNames":["Florian Harr"],"timeStart":"02:30 PM","timeEnd":"15:20 PM","tracks":["iOS"],"start":"14:30"},{"name":"Horizontally Scaling Node.js and WebSockets","location":"Node.JS","description":"Underneath every breakout website or app is a horizontally scaling back-end, but how do we get from a single process Node.js server to a highly-available, auto-scaling system? In this talk, we’ll take a high level look at a full production stack before getting our hands dirty with the secret sauce: Node.js, WebSockets and Redis. Through a live coding demo, you’ll learn how to take a single-server app and scale it infinitely. Walk away with a better conceptual understanding of high-scale web systems and practical tools to start implementing these techniques in your own projects today.","speakerNames":["James Simpson"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Node.JS / Server-side JS"],"start":"14:30"},{"name":"Kotlin for the Busy Android Developer","location":"Android","description":"Android has been the most widely installed mobile operating system in the world since 2013. It’s an awesome platform and its open source code, which can be used on various different devices, has made it a popular choice for many projects and applications. That said, for developers, Android does have one Achilles heel: Java. The release of Kotlin 1.0 offers a compelling alternative. But, it is a good idea to use it? Let’s take a tour of Kotlin with code samples, cat pictures, and a little bit of live coding. Learn how to put your codebase on a diet and improve its readability by converting your existing classes to Kotlin. See how you can improve your code quality by using the built-in null safety, and how to make unit testing more pleasurable by using the Spek framework. Along the way, we’ll share tips and tricks for using Kotlin in production apps. By the end of this talk you’ll have enough knowledge to confidently start to use Kotlin in your Android projects.","speakerNames":["Lance Gleason"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Android"],"start":"14:30"},{"name":"Does the network seem thin up here? Collaborating over mountaintop mesh networks.","location":"Misc","description":"<p>Digital nomads can now work anytime, anywhere—but often with <strong>no WiFi.</strong> Despite the explosion of feature-rich web apps, offline editors like Microsoft Word remain their tool of choice, leaving them out in the cold when it comes to realtime collaboration.</p>\r\n\r\n<p>With the help of <em>Operational Transforms</em> + <em>Conflict-Free Replicated Data Types,</em> peer-to-peer web apps can enable writers, musicians and other creators to collaborate <em>off-the-grid</em> and climb up to the writer’s ultimate dream: <strong>collaborative writing atop Half Dome.</strong></p>\r\n\r\n<p><em>Oh, and we won’t need conference WiFi.</em></p>","speakerNames":["Jonathan Martin"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["JavaScript Practices"],"start":"14:30"}]},{"time":"15:30","sessions":[{"name":"Break & Getting Started with IoT (IoT Lounge)","location":"Foyer","description":"Come find out resources, tips, and tricks on getting started with IoT. Looking to find out more about different boards and their capabilities or which programming language to use? This quick overview will touch on a variety of information for beginning with IoT and identify a number of great resources for getting started.","speakerNames":["Kristin Ottofy"],"timeStart":"03:30 PM","timeEnd":"16:00 PM","tracks":["IoT Lounge"],"start":"15:30"}]},{"time":"16:00","sessions":[{"name":"Introduction to Aurelia","location":"CoreJS","description":"Aurelia is a next generation JavaScript client framework for mobile, desktop and web. It's the most standards-compliant, highly performing and simplest technology of its kind today. In this course you'll have an opportunity to learn how to create modern web applications using an MVVM approach with Aurelia. You also will learn how to extend HTML with custom elements and attributes, how to handle client-side routing and even cover best practices in project organization, maintenance and deployment.","speakerNames":["Ashley Grant"],"timeStart":"04:00 PM","timeEnd":"16:50 PM","tracks":["Core JavaScript & Frameworks"],"start":"16:00"},{"name":"Building distributed systems with Redux","location":"React.JS","description":"Redux is a implementation of the FLUX architecture. Actions are dispatched to cause side effects within your application. Actions are plain JSON, and easily serializable. In this talk we will experiment with Redux as elegant solutions to distributed systems.","speakerNames":["Clint Ayres"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["React.JS"],"start":"16:00"},{"name":"Things I learned from Angular 2's Source","location":"AngularJS","description":"Angular 2 is one of the most discussed technologies during the past year. There are plenty of rumors about the rocket science powering the framework and its exceptional scalability, portability and speed.\r\n\r\nA lot of features make Angular unique - runtime generation of VM friendly code that takes advantage of inline-caching, cross-platform portability, facades which allows the same code to be transformed to both Dart and TypeScript, tree-shakable architecture, etc.\r\n\r\nAlthough all this sounds curious, it is hard to explore each individual concept by taking a deep dive at the Angular's codebase which exceeds 100k lines of code. In this talk I will synthesize some of the most interesting things that I discovered during my contribution to the project and involvement in the Angular community.","speakerNames":["Minko Gechev"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["AngularJS"],"start":"16:00"},{"name":"Creating meaningful HTML and CSS ","location":"HTML5/CSS3/Web","description":"Creating meaningful HTML and CSS : The BEM way!","speakerNames":["Rachita Joshi"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["Web / HTML / CSS"],"start":"16:00"},{"name":"Make Web Forms Great Again","location":"Design","description":"Has your web form conversion rate hit a wall? Are users skipping filling out your long forms, not receiving confirmation e-mails, or getting pestered with password or data format warnings *after* they finish entering their information? If so, then it's time to #MakeWebFormsGreatAgain. Learn suggestions of A/B tests you can try with your web forms to help encourage more people to interact.","speakerNames":["Andrew Malek"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["Design & UI & UX"],"start":"16:00"},{"name":"Action-Domain-Responder: MVC for the Web","location":"PHP","description":"Using Model-View-Controller as a pattern to describe stateless HTTP interactions has always been a bit of a kludge. There simply hasn't been a better pattern web applications -- until now.  ADR (Action-Domain-Responder) represents a refinement of generic MVC as an application architecture specifically tuned to the web. In this talk, we will discuss various patterns of overall application architecture, including MVC, MVP, PAC, DCI, RMR, and others. We will find out how the ADR pattern arises from generic MVC, and how it provides a better description of how web applications actually work. Finally, we will go over examples of how to architect an ADR application, as well as how to convert from an MVC architecture to an ADR one.","speakerNames":["Paul M. Jones"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["PHP"],"start":"16:00"},{"name":"The New Mobile Web: Service Worker, Push and App Manifests","location":"Mobile General","description":"Not just another \"Progressive Web Apps\" talk.\r\n\r\nCompared to native apps, mobile websites have historically been at a disadvantage: no installation, no push notifications, and they only work when you're online.\r\n\r\nThis year, that changed.\r\n\r\nThis session examines how the new Service Worker, Push, and App Manifest specifications fill the gaps between web and native. But this isn't just another \"Progressive Web App\" talk; instead, we'll dicuss the new APIs individually, emphasizing their flexibility and countering the one-size-fits-all hype.\r\n\r\nThis talk will cover:\r\n\r\n1. How to use Service Workers as a programmable proxy/cache for your website, which allows you to make resources available offline.\r\n\r\n2. How to use Push to send notifications to your website's users, even when they don't have your site open.\r\n\r\n3. How to use a Web App Manifest to control your site's presentation and installability.\r\n\r\nWe'll also discuss how, taken together, they allow us to create mobile web experiences that are virtually indistinguishable from native. Or not. How you use these specs really is up to you.","speakerNames":["Dan Callahan"],"timeStart":"04:00 PM","timeEnd":"16:50 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"16:00"},{"name":"Session: iOS in the Enterprise","location":"iOS","description":"The enterprise environment is different than a commercial or consumer facing development effort. In this intermediate level workshop workshop, we'll cover these topics and take a deep dive into the challenges facing enterprise app developers: Monitoring the app in the field, Enterprise UX concerns, Privacy concerns, APIs and capabilities you'll only use in the enterprise, Enterprise deployment walled garden, Advanced problem solving for application design and performance","speakerNames":["Carol Shepherd"],"timeStart":"04:00 PM","timeEnd":"16:50 PM","tracks":["iOS"],"start":"16:00"},{"name":"Developing IOT and Smart Devices at Scale with the Cloud ","location":"Node.JS","description":"This session will cover how to develop secure, scalable, IoT cross-device solutions with Node.js IoT frameworks like Johnny Five as well as, building data backend for your IoT and Smart Devices with the Cloud. ","speakerNames":["Tara Walker"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["Node.JS / Server-side JS"],"start":"16:00"},{"name":"Activities in the Wild: Exploring the Android Activity Lifecycle","location":"Android","description":"To Android users, your Activity object <em>is</em> your app.  Take a journey with me to experience what happens to your Activity’s state and view at runtime in relation to what the user (and the operating system itself) is doing.  We will discuss considerations you should make based on this knowledge when designing and building your app.  You will walk away from this talk with a strong understanding of the most fundamental piece of Android applications.  ","speakerNames":["Kristin Marsicano"],"timeStart":"04:00 PM","timeEnd":"16:40 PM","tracks":["Android"],"start":"16:00"},{"name":"Jasmine and Cucumber - a Tasty way to Deliver Better Code Faster","location":"Misc","description":"Behavior Driven Development is a proven way to deliver higher quality code to meet your business’ requirements in less time and you can add it to any agile processes (like Scrum) that does not specify how software should be developed.\r\n\r\nIn this session we’ll look at two BDD frameworks; Cucumber and Jasmine. Cucumber is a tool that lets you turn user stories into executable specifications that run every time you check in a code change, so you can verify that what you’re delivering meets the business’ acceptance criteria. Jasmine can be used to write lower level specifications that describe the services needed to make the executable specifications pass. You can use it to write unit tests that ensure the code you’ve written behaves the way you expect. \r\n\r\nUsing them together leads to some nice results. You only write code needed to meet the user acceptance criteria, your code behaves the way you expect it to, and you can safely refactor your code to improve clarity, simplify its structure, or meet any other metric you deem necessary. This focused development results in highly cohesive, loosely coupled code, which means it’s easier to debug, maintain and enhance. Now isn’t that a tasty treat?","speakerNames":["Burk Hufnagel"],"timeStart":"04:00 PM","timeEnd":"17:00 PM","tracks":["JavaScript Practices"],"start":"16:00"}]},{"time":"17:00","sessions":[{"name":"Break & Ghostbusters IoT (IoT Lounge)","location":"Foyer","description":"Ever tried to catch a ghost with IoT? This quick session will demo how to use a Raspberry Pi, sensors, and some sweet 3d printed gear to identify ghosts!","speakerNames":["Kristin Ottofy"],"timeStart":"05:00 PM","timeEnd":"17:10 PM","tracks":["IoT Lounge"],"start":"17:00"}]},{"time":"17:10","sessions":[{"name":"Web Components & Polymer: Lego bricks of the web","location":"CoreJS","description":"Writing the same login form over and over again? Web components offer a modular approach to creating reusable UI widgets. Ditch large, complex frameworks and drop these lightweight building blocks into your site. We will show you how to build, test, and deploy a web component, and introduce you to the wide selection of existing web components available through Google’s Polymer.","speakerNames":["Abraham Williams","Pearl Latteier"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["Core JavaScript & Frameworks"],"start":"17:10"},{"name":"Isomorphic React w/o Node??","location":"React.JS","description":"React is a JavaScript UI library with components that can render server-side for improved SEO and initial browser load time. But how do you render JavaScript React components on the server if your backend doesn’t run on Node? Learn how Eventbrite successfully integrated React with their Python/Django backend so that you can do the same in yours.","speakerNames":["Ben Ilegbodu"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["React.JS"],"start":"17:10"},{"name":"Scaling large Angular 1 apps","location":"AngularJS","description":"Although Angular JS is a powerful framework, we still need conventions, automation and a variety of tools to make it scale. Especially in a team environment. Learn how to scale your angular apps with simple but effective techniques, endorsed by the Angular community.\r\n\r\nThere are so many Angular 1 apps out there that won't be upgraded to Angular 2... but they still need to be updated with new features & be able to serve a lot of users. ","speakerNames":["Jad Joubran"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["AngularJS"],"start":"17:10"},{"name":"Getting Started with Jekyll for Static Sites","location":"HTML5/CSS3/Web","description":"Static sites offer fantastic benefits in things like security and performance. Static site generators have made it easier to build and maintain static sites. Jekyll is the most widely used and, in my opinion, the best overall option for static site development. In this session, we'll cover how to get started with Jekyll to build, customize and maintain a static site.","speakerNames":["Brian Rinaldi"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["Web / HTML / CSS"],"start":"17:10"},{"name":"Creating a Mobile UX Strategy ","location":"Design","description":"Of businesses that have mobile solutions, 44% report the solution wasn’t adopted due to poor user experience. Mobile UX is fundamentally different than web. It’s crucial to think through every factor including platform, content, implementation, performance and goals. By understanding the role that UX plays in a mobile strategy you can prevent low adoption rates and instead create a successful project.  \r\n","speakerNames":["Grant Davies"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["Design & UI & UX"],"start":"17:10"},{"name":"Iterators, ArrayAccess & Countable – Oh My!","location":"PHP","description":"Learn how to empower your objects in PHP with SPL! The SPL (Standard PHP Library) has existed for many years but is still one of the less understood parts of the language. We will cover some of the most useful core aspects of the SPL, features that are easy to add to your own objects, making them more powerful and flexible!","speakerNames":["Eli White"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["PHP"],"start":"17:10"},{"name":"Native vs Hybrid","location":"Mobile General","description":"Panel Discussion on native platform and hybrid platform for mobile development. If you’re confused and wondering whether to build a hybrid mobile app or a native mobile app this discussion panel will make it easy for you to decided.\r\n\r\nNative App: This is platform (iOS, Android etc.) specific and requires unique expertise. \r\n\r\nHybrid App: Developer augments web code with native SDK and can be easily deployed across multiple platform.\r\n\r\nThis discussion will address mobile app development in general, it is specifically targeted at developers looking to create mobile applications but want to know what platform would work for them.","speakerNames":["Alicia V Carr"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"17:10"},{"name":"Go to General Mobile session","location":"iOS","description":"Go to one of the general mobile session for the \"hybrid vs native panel\" or \"mobile ux\" in this timeslot; check schedule for room number","speakerNames":[],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["iOS"],"start":"17:10"},{"name":"Introduction to LoopBack","location":"Node.JS","description":"An introduction to building APIs with the open-source framework, LoopBack. Some familiarity with APIs and Node.js in general is suggested. ","speakerNames":["Raymond Camden"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["Node.JS / Server-side JS"],"start":"17:10"},{"name":"Go to General Mobile session","location":"Android","description":"Go to one of the general mobile session for the \"hybrid vs native panel\" or \"mobile ux\" in this timeslot; check schedule for room number","speakerNames":[],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["Android"],"start":"17:10"},{"name":"Your Code is Terrible, I Love It!","location":"Misc","description":"Nearly all big projects started out as a small codebase, sometimes even as a POC. When trying to quickly prove out functionality and get a lean version of your product to your customer, you're going to write some sh***y code. It's the nature of the profession. This is not a problem until that wee little app of yours grows into a giant beast. Then you're in trouble because it's an unmaintainable nightmare. This talk will show you techniques for how to take your heaping pile and polish it up enough to sell at the gift shop.","speakerNames":["Patrick Seda"],"timeStart":"05:10 PM","timeEnd":"18:10 PM","tracks":["JavaScript Practices"],"start":"17:10"}]},{"time":"18:10","sessions":[{"name":"Attendee party (in conference center bar)","location":"CoreJS","description":"","speakerNames":[],"timeStart":"06:10 PM","timeEnd":"20:10 PM","tracks":[null],"start":"18:10"}]}]},{"date":"2016-10-22","groups":[{"time":"09:00","sessions":[{"name":"A Programmer's Guide to Humans  (Keynote in Ballroom ABE)","location":"CoreJS","description":"What makes software development complex isn't the code, it's the humans. The most effective way to improve our capabilities in software development is to better understand ourselves.\r\n\r\nIn this talk, I'll introduce a conceptual model for human interaction, identity, culture, communication, relationships, and learning based on the foundational model of Idea Flow. If you were to write a simulator to describe the interaction of humans, this talk would describe the architecture.\r\n\r\nLearn how to understand the humans on your team and fix the bugs in communication, by thinking about your teammates like code!\r\n\r\nI'm not a scientist or a psychologist. These ideas are based on a combination of personal experience, reading lots of cognitive science books, and a couple years of running experiments on developers. As I struggled through the challenges of getting a software concept from my head to another developer's head (interpersonal Idea Flow), I learned a whole lot about human interaction.\r\n\r\nAs software developers, we have to work together, think together, and solve problems together to do our jobs. Code? We get it. Humans? WTF?!\r\n\r\nFortunately, humans are predictably irrational, predictably emotional, and predictably judgmental creatures. Of course those pesky humans will always do a few unexpected things, but once we know the algorithm for peace and harmony among humans, we can start debugging the communication problems on our team.","speakerNames":["Janelle Klein"],"timeStart":"09:00 AM","timeEnd":"10:00 AM","tracks":[null],"start":"09:00"}]},{"time":"10:00","sessions":[{"name":"Break I","location":"Foyer","description":"","speakerNames":[],"timeStart":"10:00 AM","timeEnd":"10:10 AM","tracks":[null],"start":"10:00"}]},{"time":"10:10","sessions":[{"name":"Webpack: A Simple Introduction to a Complex Tool","location":"CoreJS","description":"","speakerNames":["John Mercer"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Core JavaScript & Frameworks"],"start":"10:10"},{"name":"Pure Functions: An Introduction to Functional Programming in JavaScript","location":"React.JS","description":"Pure functions are the foundation of functional programming. Using pure functions can make application development in JavaScript easier. But what is a pure function? In this session, you'll learn what pure functions are and how you can use them to simplify your development process. In addition, we'll look at using pure functions to build applications in JavaScript with React and Redux.","speakerNames":["Jonathan Kemp"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["React.JS"],"start":"10:10"},{"name":"Preparing Angular 1.x apps to upgrade to Angular 2","location":"AngularJS","description":"Preparing Applications to Upgrade to Angular 2\r\nRefactoring Angular 1.5 ","speakerNames":["John Mercer"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["AngularJS"],"start":"10:10"},{"name":"An Intro to Web VR","location":"HTML5/CSS3/Web","description":"This talk discusses the state of Web VR today: What is Web VR? What are the technologies surrounding it? And where will it go?","speakerNames":["Dee Del Rosario"],"timeStart":"10:10 AM","timeEnd":"10:50 AM","tracks":["Web / HTML / CSS"],"start":"10:10"},{"name":"ImprovUX","location":"Design","description":"ImprovUX: A talk that brings the worlds of Improvisation and User Experience together...accept they're actually part of the same world with the same ideas and philosophies.","speakerNames":["Jim Karwisch","Mike Gorgone"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Design & UI & UX"],"start":"10:10"},{"name":"PHP 7: The New New PHP","location":"PHP","description":"PHP 7: Why aren't you using it yet?  Here's an hour of awesome, brought to you by PHP 7.","speakerNames":["Larry Garfield"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["PHP"],"start":"10:10"},{"name":"Cross-Cross Platform","location":"Mobile General","description":"You can utilize Xamarin to write cross platform applications, but did you know the real win can be when you can use it across all platforms - mobile and web?  ","speakerNames":["James Prolizo"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["General Mobile: Design, Tools, Testing"],"start":"10:10"},{"name":"Creating Connections with Core Location and Map Kit","location":"iOS","description":"We live in a world in which technology keeps us closely linked us to our surroundings. Using location-based information in your iOS applications can greatly enhance the user experience, but it’s important to know how to use Core Location and Map Kit correctly in order to optimize accuracy without consuming too much power. In this talk, we’ll take a tour of these frameworks with code samples to demonstrate functionality like indoor positioning, visit monitoring, geofencing, and iBeacons. We’ll also discuss user privacy and authorization for location usage.","speakerNames":["Marlene Jaeckel"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["iOS"],"start":"10:10"},{"name":"Testing in JavaScript","location":"Node.JS","description":"TBD","speakerNames":["Han Solo"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["Node.JS / Server-side JS"],"start":"10:10"},{"name":"Data Persistence Essentials","location":"Android","description":"We store a lot of data in our apps, for example, a user’s name and email, a list of friends, to sports scores, just to name a few. The variety of ways to perform this essential task can be overwhelming. In this talk, we will cover the primary forms of data persistence, including best practices.","speakerNames":["David Hope"],"timeStart":"10:10 AM","timeEnd":"11:00 AM","tracks":["Android"],"start":"10:10"},{"name":"Getting More Out of Git","location":"Misc","description":"Having trouble groking Git? Not sure what the difference between merging and rebasing is? Wondering what you would ever use a \"cherry-pick\" for? We'll cover these topics and more in this talk, helping attendees get past Git novice and on their way to Git master. The talk will being with a short overview of git fundamentals, but quickly jump into more advanced concepts. We'll cover branching, commit amending, stashing, cherry-picking, and yes, merging versus rebasing. You might not be a Git guru after one conference session, but you will have a better understanding of how to play nicely with others in the same Git repository and how to fix common (and not so common) issues in Git.","speakerNames":["Jordan Kasper"],"timeStart":"10:10 AM","timeEnd":"11:10 AM","tracks":["JavaScript Practices"],"start":"10:10"}]},{"time":"11:10","sessions":[{"name":"Break II","location":"Foyer","description":"","speakerNames":[],"timeStart":"11:10 AM","timeEnd":"11:20 AM","tracks":[null],"start":"11:10"}]},{"time":"11:20","sessions":[{"name":"JavaScript Objects Deep Dive","location":"CoreJS","description":"Bob, our tour guide, will take us on a unique visual tour of JavaScript objects. We'll explore where the community has been and where it is going with a visual approach to creating and relating objects, prototype chains, inheritance, composition, and all that fun stuff. ","speakerNames":["Bob Holben"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Core JavaScript & Frameworks"],"start":"11:20"},{"name":"React Router 4.0: What's New","location":"React.JS","description":"React Router 4.0 brings some big changes to the most popular routing library in the React ecosystem. Come see what's new and all the improvements in this latest API overhaul.","speakerNames":["Tim Dorr"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["React.JS"],"start":"11:20"},{"name":"Forming an opinion about Angular Forms in 1.X and 2.0","location":"AngularJS","description":"Forming an opinion about Angular Forms in 1.X and 2.0","speakerNames":["Peter Pavlovich"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["AngularJS"],"start":"11:20"},{"name":"CSS from the Future","location":"HTML5/CSS3/Web","description":"For years, we’ve relied on preprocessors to simplify CSS development, but the time is coming when we won’t need this anymore. Variables, mixins, mathematic calculations, color manipulation, and nested selectors are all in the official specification, at various stages of development. Nearly every feature provided by SASS and LESS is coming to the browser. Some of it has already arrived. Some of it is even more powerful than the preprocessor you are used to.\r\n\r\nIn this talk, I’ll show you how all these features work. And I’ll show you how, using the PostCSS processor, you can transpile this future syntax into code you can use today. Come take a glimpse at what the future of CSS holds.","speakerNames":["Keith J Grant"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Web / HTML / CSS"],"start":"11:20"},{"name":"A Dad’s Eye View of the Coming Infopocalyse","location":"Design","description":"<p>Technology is ruining the youth of today... and it’s going to be <b>awesome</b>. My 5yr old son lives in a world where all media is on-demand, all screens are touch screens, and most of his physical toys have embedded software. He plays with devices differently than I did and expects more from them. This talk will provide a glimpse of the future and how to design experiences for the next generation.</p>","speakerNames":["Josh Marinacci"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Design & UI & UX"],"start":"11:20"},{"name":"PSR-7 and Action-Domain-Responder","location":"PHP","description":"In this talk, we will discuss PSR-7 (the \"HTTP Messages\" recommendation) and how it can be used with the Action-Domain-Responder pattern, particularly when it comes to middleware-based systems. We will also go over some PSR-7/ADR libraries and frameworks, such as Relay, Arbiter, and Radar, and address opinions on the separation of concerns between HTTP user interfaces and the underlying application domain.\r\n","speakerNames":["Paul M. Jones"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["PHP"],"start":"11:20"},{"name":"Using Jenkins for Continuous Cross Platform Mobile Development and Distribution","location":"Mobile General","description":"Ease your team's mobile development, testing and distribution workflow by getting Jenkins to handle (most) all of the tedious bits.","speakerNames":["Adam Paxton"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"11:20"},{"name":"What the Swiftly Func?","location":"iOS","description":"Functional programming is all the rage, but what is it exactly.  Without resorting to confusing terms like 'Monad' and 'Functor', this talk seeks to shed a little light on this Important yet confusing approach to programming.","speakerNames":["James Majors"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["iOS"],"start":"11:20"},{"name":"Introduction to Microsoft Graph with Node.js","location":"Node.JS","description":"Overview of using Office Graph API with Node.js to access and manipulate Office 365 data","speakerNames":["Kristin Ottofy"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Node.JS / Server-side JS"],"start":"11:20"},{"name":"Communicating with Android Devices","location":"Android","description":"Android apps need to be notified of server side events as well as update the server with their state.  This talk will survey several options as well as go into detail for push using Google’s Firebase Cloud Messaging.\r\n","speakerNames":["Summers Pittman"],"timeStart":"11:20 AM","timeEnd":"12:20 PM","tracks":["Android"],"start":"11:20"},{"name":"Javascript Software Craftsmanship Part 1","location":"Misc","description":"Becoming an expert coder involves much more than learning the coolest new framework or becoming a design pattern ninja.  Becoming an expert coder is about passion and craftsmanship. In this two-part series we will dive into Software Craftsmanship, what it is and how it has not only influenced but also refactored our industry and trade. We wont stop there, we will discuss how to grow beyond being a commodity coder to being mentored and mentoring others, who the mentors are, and how to take ownership of your coding career.  Finally we will look at what often makes JS code suk and the often ignored but essential disciplines of master software craftsmen and how these apply to JS coders.","speakerNames":["Stephen M. Carlson"],"timeStart":"11:20 AM","timeEnd":"12:10 PM","tracks":["JavaScript Practices"],"start":"11:20"}]},{"time":"12:20","sessions":[{"name":"lunch(human)","location":"Foyer","description":"","speakerNames":[],"timeStart":"12:20 PM","timeEnd":"13:20 PM","tracks":[null],"start":"12:20"}]},{"time":"13:20","sessions":[{"name":"Wed, Bed, or Dead ( or how to pick the tech stack for your next project)","location":"CoreJS","description":"<p>\r\nEveryone wants to be the cool kid using the tools and frameworks that all of the cool kids are using.  But, is the frame work the right choice for your project? Does it scale? Is it flexible? Maintainable? Is it for right now (bed)? Or if you use (wed) it, how difficult is it to switch to something else? Go through the process of evaluating libraries and frameworks to decide if and how they would fit into the architecture of your next project.\r\n</p>\r\n","speakerNames":["Delicia Brummitt"],"timeStart":"01:20 PM","timeEnd":"14:10 PM","tracks":["Core JavaScript & Frameworks"],"start":"13:20"},{"name":"Creating more efficient React views using windowing techniques","location":"React.JS","description":"Learn how to speed your React views up by only rendering what the user wants to see. This technique (commonly referred to as \"windowing\") is easy to integrate into existing views and can provide huge performance gains.","speakerNames":["Brian Vaughn"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["React.JS"],"start":"13:20"},{"name":"Building a progressive web app with Angular 2","location":"AngularJS","description":"Progressive web apps can give your website a native like user experience.\r\nAngular 2 makes it easier than ever to build progressive web apps with its new mobile toolkit.\r\nLearn how to get started and build your own PWA using Angular 2!","speakerNames":["Jad Joubran"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["AngularJS"],"start":"13:20"},{"name":"Open Source Web Performance Tooling","location":"HTML5/CSS3/Web","description":"Web Performance measurement and monitoring have come a long way since the mid 2000's. Now the topic is at the top of mind for the world's largest companies who are tying mission-critical business initiatives to web performance metrics as they relate to revenue.\r\nBut what is web performance when it comes to monitoring and measurement? What are those numbers, how are they tracked and why do they matter? \r\nThis talk will drill down on today's web performance monitoring toolset and how to introduce true perf monitoring at the bottom-most level of software development (where simple bugs are easy and less costly to fix.)","speakerNames":["Wesley Hales"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Web / HTML / CSS"],"start":"13:20"},{"name":"Tablets and Hybrids Need Mobile-Optimized Websites, Too!","location":"Design","description":"It takes extra work to deliver a truly responsive website. Since larger tablets and hybrids such as iPad Pros and Windows Surface devices can fit the full size of a standard laptop/desktop website, a tempting thought is to save time and deliver to them the exact same experience. This talk may change your mind, elaborating on why that kind of thinking can hamper the user experience and possibly drive people away, perhaps to access your website on a laptop or smartphone, or worse yet to a competitor.","speakerNames":["Andrew Malek"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Design & UI & UX"],"start":"13:20"},{"name":"Aphorisms of API Design","location":"PHP","description":"How can we build code that's intended to last and stay robust in the face of change?  What matters are your APIs.  Let's see how to build good, solid code.","speakerNames":["Larry Garfield"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["PHP"],"start":"13:20"},{"name":"Developing Cross-Platform, Native Apps in JavaScript","location":"Mobile General","description":"Overview of methods of developing cross-platform native apps in JavaScript, understanding the differences between cross-platform native and hybrid apps, the different choices and drilling down into one of them to see how it's done in practice.","speakerNames":["Jason Kneen"],"timeStart":"01:20 PM","timeEnd":"14:10 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"13:20"},{"name":"Confusion Optional","location":"iOS","description":"Optional can be confusing, with '?' and '!'.  What does it all mean?  This talk will help you understand the whys and how's of using this important type in Swift","speakerNames":["James Majors"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["iOS"],"start":"13:20"},{"name":"Creating Robust Cloud Services using Node.js","location":"Node.JS","description":"Cloud services enable mobile apps to have many modern features, such as user accounts, profiles, authentication, and persistent data. This lecture will discuss how to create a scalable infrastructure that provides platform-agnostic REST-based services and how to connect them to iOS applications. Server-side frameworks and libraries include Node.js, Express, MongoDB, Passport, and Composable-Middlewares. We will show the end-to-end solution by building an iOS app, using Swift and Alamofire.","speakerNames":["Stephen Schwahn"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Node.JS / Server-side JS"],"start":"13:20"},{"name":"Think Globally, Code Locally","location":"Android","description":"Want to reach billions of users? Support i18n, L10n, and a11y. An English-only app can reach around 350 million native speakers. But there are 8 other languages that have more than 100-million native speakers, including 900 million who count Mandarin Chinese as their first language. While about 600 million people speak English as a second language, adding support for multiple languages is a great way to extend your audience. Making the applications accessible not only makes them available to 10-25% of the population who wouldn't be able to use them otherwise, it also improves the design and testability.\r\n\r\nThis talk presents i18n/L10n and a11y technologies in iOS and Android.","speakerNames":["Bolot Kerimbaev"],"timeStart":"01:20 PM","timeEnd":"14:20 PM","tracks":["Android"],"start":"13:20"},{"name":"Javascript Software Craftsmanship Part 2","location":"Misc","description":"Becoming an expert coder involves much more than learning the coolest new framework or becoming a design pattern ninja.  Becoming an expert coder is about passion and craftsmanship. In this two-part series we will dive into Software Craftsmanship, what it is and how it has not only influenced but also refactored our industry and trade. We wont stop there, we will discuss how to grow beyond being a commodity coder to being mentored and mentoring others, who the mentors are, and how to take ownership of your coding career.  Finally we will look at what often makes JS code suk and the often ignored but essential disciplines of master sotware craftsmen and how these apply to JS coders.","speakerNames":["Stephen M. Carlson"],"timeStart":"01:20 PM","timeEnd":"14:10 PM","tracks":["JavaScript Practices"],"start":"13:20"}]},{"time":"14:20","sessions":[{"name":"Break III","location":"Foyer","description":"","speakerNames":[],"timeStart":"02:20 PM","timeEnd":"14:30 PM","tracks":[null],"start":"14:20"}]},{"time":"14:30","sessions":[{"name":"Creating Kickass Data Visualizations with D3","location":"CoreJS","description":"Tired of boring charts that all look the same or only have a few configurations? Join me in a D3js jumpstart session to learn the core concepts of D3. The goal is to show D3 capabilities, core concepts, and gotchas, so you can start building kickass data visualizations. Set yourself free by learning how D3js can provide all the tools needed to visualize data on the web. ","speakerNames":["Chris Morrow"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Core JavaScript & Frameworks"],"start":"14:30"},{"name":"Re-energize Your Workflow with React and Redux","location":"React.JS","description":"Redux helps you build applications with React by making it easier to manage data changes and state in your application. In this talk, Jonathan walks you through building applications with React and Redux using ES6, Babel and Webpack. ","speakerNames":["Jonathan Kemp"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["React.JS"],"start":"14:30"},{"name":"Building a Secure Chat App with AngularJS and Ionic","location":"AngularJS","description":"<p>A basic chat app in AngularJS is pretty easy.  It can be done in about 50 lines of code plus a simple NodeJS backend to repeat messages. Making a good and complete chat app, however, is far more difficult.  This talk will cover building a chat app from beginning to end, including scroll back history, offline notifications, authentication, security, and packaging for publishing in mobile app stores.</p>","speakerNames":["Josh Marinacci"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["AngularJS"],"start":"14:30"},{"name":"Leave No One Behind: Building Accessible Web Applications","location":"HTML5/CSS3/Web","description":"Over 50 million adults in the US have a disability, and some of them want to use your web site. Can they? This session will not only help you answer that question, it will help you answer \"Yes.\" Join us as we learn how to build web applications accessible to everyone.","speakerNames":["Stephen A Thomas"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Web / HTML / CSS"],"start":"14:30"},{"name":"ExD: Designing for Exponential Change","location":"Design","description":"An exploration of basic Design Principles and the forcing functions of Exponential Growth, Miniaturization and Dematerialization. Application of these concepts will be demonstrated using a custom set of \"Method Cards\" that can be sorted and discussed to inform and inspire research and design.","speakerNames":["Will Jayroe"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Design & UI & UX"],"start":"14:30"},{"name":"Developing Bots for Slack","location":"PHP","description":"Slack has become incredibly popular, and it provides a new way for developers to build applications, and services. There is a lot of interest in creating for this platform, but there's more to it than just code. The whole process from research, to publishing and distribution will be covered in this session.","speakerNames":["Nic Rosental"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["PHP"],"start":"14:30"},{"name":"Creating Interactive Multiplayer Experiences with Firebase","location":"Mobile General","description":"Building realtime features that work on all your different devices is the holy grail of app development. The Firebase Realtime Database lets you store and sync data instantly, and allows you to build a web, mobile or Unity application in minutes without worrying about wiring up a backend. The real time aspect and a number of lesser known, powerful features (such as transactions) make it possible to create a multiplayer gaming experience as well.\r\n\r\nIn this session, we'll twist the traditional rock-paper-scissors into a web based, multiplayer  happy-surprised-angry game using your facial expressions and a web-cam. We’ll use both old and new Firebase features to keep track of online players, synchronize game state across multiple connections, create chat rooms, and match players together for game play.","speakerNames":["Mark Mandel"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"14:30"},{"name":"Optimizing app install and user on boarding costs","location":"iOS","description":"While there are many effective mobile app advertising platforms, understanding which networks are most effective an on boarding new users requires measurement.  Patrick will describe best practices for app conversion tracking and measurement with specific examples from previous apps he has worked on.","speakerNames":["Patrick Childers"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["iOS"],"start":"14:30"},{"name":"You Too Can Build a Bot: Programming Bots in Node.JS For Beginners","location":"Node.JS","description":"From Google to Disney, Slack and Facebook, enterprise and consumer, conversational bot interfaces are a hot new trend for 2016. You may think that bots are difficult to program, but with knowledge of Node.JS, they're a lot simpler than you think. Come and learn how to build your first bot.","speakerNames":["Anthony Jesmok"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["Node.JS / Server-side JS"],"start":"14:30"},{"name":"Testing Android Apps with Software Robots","location":"Android","description":"Software robots like monkey provide a quick way to validate your application. With robots on new cloud testing services, it is easier than ever to get started testing your app without even having written any tests. In this talk, I will introduce a few tools from both academia and industry, and then cover the basics of how these tools work. You will learn about the strengths and limitations these tools and how to use them effectively to maximize code coverage and catching failures. ","speakerNames":["Shauvik Roy Choudhary"],"timeStart":"02:30 PM","timeEnd":"15:00 PM","tracks":["Android"],"start":"14:30"},{"name":"Getting Started with Elm Lang","location":"Misc","description":"Tired of JavaScript errors and hard to debug code? Interested in writing more functional JavaScript? Then I believe that Elm is the tool you are looking for. Elm helps you write HTML web apps extremely fast all while pushing you towards well-architected code.","speakerNames":["Tim Whitacre"],"timeStart":"02:30 PM","timeEnd":"15:30 PM","tracks":["JavaScript Practices"],"start":"14:30"}]},{"time":"15:30","sessions":[{"name":"Break IV","location":"Foyer","description":"","speakerNames":[],"timeStart":"03:30 PM","timeEnd":"15:40 PM","tracks":[null],"start":"15:30"}]},{"time":"15:40","sessions":[{"name":"Testing ES6 and TypeScript apps with Intern","location":"CoreJS","description":"Learn how to test all the things with your modern ES6 and/or TypeScript applications using Intern.","speakerNames":["Dylan Schiemann"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["Core JavaScript & Frameworks"],"start":"15:40"},{"name":"Deploying GraphQL in a Serverless Architecture","location":"React.JS","description":"GraphQL's flexibility has made it an intriguing and necesary choice for frontend developers. These developers seem to understand the benefits of using GraphQL before their backend counterparts, but have a hard time selling the benefits in a way that causes the backend team to grasp. Most concerns from backend developers are around the GraphQL structure, reimplemenation of existing logic and deployment. What if you could deploy GraphQL without the need to deploy and manage entire servers? In this talk we'll explore using GraphQL in a serverless context with AWS Lambda, using the Serverless framework. We'll look at the pros and cons of deploying GraphQL in such an architecture.","speakerNames":["Kevin Old"],"timeStart":"03:40 PM","timeEnd":"16:10 PM","tracks":["React.JS"],"start":"15:40"},{"name":"Angular 2 Toolset Support","location":"AngularJS","description":"The tooling support of the modern web frameworks advances constantly. It helps us with managing boilerplates, having more efficient and automated build process. It even helps us be more consistent and confident during our development cycle, with techniques such as static code analysis!\r\n\r\nAngular is designed with tooling in mind from the beginning! Static typing, ES2015 modules and many decisions on architectural level allow development of sophisticated tools. Such tools help us be more productive during our development process.\r\n\r\nIn this talk we're going to make an overview of the toolset support for Angular. We'll briefly describe Angular CLI, Codelyzer and many other projects that can be an essential part of our development workflow!","speakerNames":["Minko Gechev"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["AngularJS"],"start":"15:40"},{"name":"Web-based Virtual Reality","location":"HTML5/CSS3/Web","description":"Virtual reality (VR) is an amazing medium that helps create immersive stories for nearly any industry, from journalism to manufacturing to gaming.  Virtual reality hardware systems like Google Cardboard, Oculus Rift, Samsung Gear and others are starting to making VR a household name.  On the software side, most of the activity is confined to native applications, but the web can bring major advantages to VR that only increase the accessibility of this platform, including experiencing VR without downloading and installing apps and allowing seamless connections from one experience to another via hyperlinks.  This session will examine the technologies bringing VR to the web including Google’s VR view & VR shell, Mozilla VR and  WebVR, a vendor--vendor-independent web standards for VR.","speakerNames":["Erica Stanley"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["Web / HTML / CSS"],"start":"15:40"},{"name":"Design TBD","location":"Design","description":"TBD","speakerNames":[],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["Design & UI & UX"],"start":"15:40"},{"name":"Easy Local Development for PHP or WordPress","location":"PHP","description":"If you program in PHP but do not yet develop LOCALLY on your laptop, especially if you develop WordPress-based websites, then this workshop if for you.","speakerNames":["Mike Schinkel"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["PHP"],"start":"15:40"},{"name":"The Mobile Dev Hamster Wheel","location":"Mobile General","description":"Keeping up with the rapid changes in mobile dev can be a huge challenge. In this session, we'll discuss strategies for dealing with the ever-changing world of mobile development: yearly releases of new mobile operating systems, updated APIs, new devices, etc.","speakerNames":["Edwin Huertas"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["General Mobile: Design, Tools, Testing"],"start":"15:40"},{"name":"Practical Generics in Swift","location":"iOS","description":"Generics are a language feature of Swift that help you limit the amount of code you need to write and create reusable solutions. In this talk I’ll cover what generics are and why you want to use them, and how you can take advantage of them even in apps that aren’t overly complex. I’ll also talk about the difference between generic functions and generic types, and what all those T’s and U’s mean.","speakerNames":["Jon Friskics"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["iOS"],"start":"15:40"},{"name":"Let's talk about R.B.A.C.: Handling authorization in NodeJS","location":"Node.JS","description":"Although many of us have used Passport to handle authentication and to a lesser extent authorization, how can we perform more fine grained controls over our features in our application? In this talk we'll discuss some ideas around RBAC and how we can use some of the built-in features of Express to handle these types of authorizations.","speakerNames":["Josh Backfield"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["Node.JS / Server-side JS"],"start":"15:40"},{"name":"Android Development For Arduino 101","location":"Android","description":"The Internet of Things (IoT) and the Quantified Self are the two most significant trends in mobile technology. Knowing how to develop software that interfaces with hardware via a mobile device is a skill every mobile developer should possess. Fortunately, many open source hardware solutions exist such as Arduino, Raspberry PI, RedBoard and a few others, which provides developers an opportunity to cultivate a thorough understanding of electronics and learn how to integrate them using software. This discussion will focus on Arduino since it is the most prominent of these solutions.","speakerNames":["Bryan Jones Richardson"],"timeStart":"03:40 PM","timeEnd":"16:30 PM","tracks":["Android"],"start":"15:40"},{"name":"Applesoft BASIC Flashback","location":"Misc","description":"Applesoft BASIC was the first programming language for many developers who grew up in the 1980s. We'll look back on this language as adults to see how it shaped our learning as developers.","speakerNames":["Corinna Cohn"],"timeStart":"03:40 PM","timeEnd":"16:40 PM","tracks":["JavaScript Practices"],"start":"15:40"}]},{"time":"16:40","sessions":[{"name":"Prize giveaways & closing!","location":"CoreJS","description":"Closing ceremonies with lots of prize giveaways including a Macbook Pro, tablets, etc!","speakerNames":[],"timeStart":"04:40 PM","timeEnd":"17:10 PM","tracks":[null],"start":"16:40"}]},{"time":"19:00","sessions":[{"name":"After-party & karaoke (downtown ATL)","location":"CoreJS","description":"","speakerNames":[],"timeStart":"07:00 PM","timeEnd":"21:00 PM","tracks":[null],"start":"19:00"}]}]}],"speakers":[{"name":"Kyle Simpson","profilePic":"http://cfp.connect-js.com/system/avatars/145/large/kylesimpson.png?1432088583","twitter":"getify","about":"Kyle Simpson is an Open Web Evangelist from Austin, TX, who's passionate about all things JavaScript. He's an author, workshop trainer, tech speaker, and OSS contributor/leader.","location":"Everywhere"},{"name":"Andrew Smith","profilePic":"http://cfp.connect-js.com/system/avatars/284/large/IMG_0061.jpg?1439213242","twitter":"andrew_codes","about":"Software craftsman, Agile enthusiast and practitioner of TDD, I am passionate about creating quality software. As a strong subscriber to the SOLID principles and TDD, I strive to develop with agility. A student at heart, I also teach to aid others in their journey. I firmly believe in continual growth and am constantly in pursuit of improvement in all things I do.","location":"Everywhere"},{"name":"Taggart Bowen-Gaddy","profilePic":"http://cfp.connect-js.com/system/avatars/283/large/me.jpg?1438816304","twitter":"taggartbg","about":"Taggart is a front end developer passionate about the future of the browser and building powerful web applications.  He is a believer in declarative, functional, human-readable code and abstractions that make our lives as developers easier.","location":"Everywhere"},{"name":"Jeremy Likness","profilePic":"http://cfp.connect-js.com/system/avatars/295/large/jeremy.jpeg?1471267133","twitter":"jeremylikness","about":"Jeremy is the director of application development and principal architect at iVision, a technology services company that leverages data center, converged infrastructure, engineering support services, delivery assurance, and application development practices to engineer the future for clients, today. Jeremy wrote his first program in 1982, was recognized in the \"who's who in Quake\" list for programming the first implementation of \"Midnight Capture the Flag\" in Quake C and has been developing enterprise applications for 20 years. For the past 15 years he has specialized in web-based delivery of line of business applications. Jeremy is the author of four technology books, a six year Microsoft MVP for Windows Platform Development, a Telerik Kendo UI Developer Expert, and speaks and writes regularly on web-based topics such as AngularJS. Jeremy is vegan and spends most of his free time running, hiking and camping with his family, watching retro science fiction movies with his daughter and playing 9-ball and one pocket.","location":"Everywhere"},{"name":"Brian Lonsdorf","profilePic":"http://cfp.connect-js.com/system/avatars/301/large/28562.jpg?1462416934","twitter":"drboolean","about":"Brian Lonsdorf is functional programmer who uses JavaScript all day at work. Sometimes he is known as that “underscore talk guy” or the author of the Mostly Adequate Guide to Functional Programming. He is a Frontend master™, a panelist on jsair, makes stop motion videos, and writes his own bios.","location":"Everywhere"},{"name":"Angie Terrell","profilePic":"http://cfp.connect-js.com/system/avatars/212/large/angie.jpeg?1439338578","twitter":"@angie_terrell","about":"","location":"Everywhere"},{"name":"Mike Hartington","profilePic":"http://cfp.connect-js.com/system/avatars/216/large/mike-headshot.png?1435605936","twitter":"@mhartington","about":"Ionic Developer, open source contributor, beer lover. Based out of beautiful Rhode Island.","location":"Everywhere"},{"name":"Daniel Steinberg","profilePic":"http://cfp.connect-js.com/system/avatars/300/large/fbmwnsd0wcpreszrdkrx.png?1462390365","twitter":"dimsumthinking","about":"Author of  \"A Swift Kickstart\" and \"Developing iOS 7 Apps for iPad and iPhone\"","location":"Everywhere"},{"name":"Kent C. Dodds","profilePic":"http://cfp.connect-js.com/system/avatars/299/large/photo.png?1470863915","twitter":"kentcdodds","about":"I am Kent C. Dodds. I work at PayPal as a full stack JavaScript engineer. I host JavaScript Air, the live video broadcast podcast about JavaScript and the web platform. I spend a bit of time on GitHub and Twitter. I’m an Egghead.io instructor and Google Developer Expert. I’m happily married and the father of three kids. I like code. I care about craft, design, tools, and architecture. I like to talk about it. Come chat with me :-)","location":"Everywhere"},{"name":"Carol Shepherd","profilePic":"http://cfp.connect-js.com/system/avatars/390/large/carol.jpg?1467396249","twitter":"walkingthedogs","about":"Carol is an Enterprise Mobile Application Designer/Developer for CBS Corporate IT. She doesn't have an app in the App Store or an open source project in GitHub and probably never will. Her projects are intended for use within the walled garden that pampers corporate professionals. She has worked as a professional in the IT industry since her sophomore year in college. She holds a BS in Computer Science with an emphasis in Artificial Intelligence and MS in Information Design and Communication. If you'd like to start a personal conversation ask her about her hobby -- raising Flemish Giant rabbits. ","location":"Everywhere"},{"name":"Daniel Steinberg","profilePic":"http://cfp.connect-js.com/system/avatars/300/large/fbmwnsd0wcpreszrdkrx.png?1462390365","twitter":"dimsumthinking","about":"Author of  \"A Swift Kickstart\" and \"Developing iOS 7 Apps for iPad and iPhone\"","location":"Everywhere"},{"name":"Todd Gandee","profilePic":"http://cfp.connect-js.com/system/avatars/143/large/todd.jpg?1439339046","twitter":"tgandee","about":"","location":"Everywhere"},{"name":"Dylan Schiemann","profilePic":"http://cfp.connect-js.com/system/avatars/182/large/parliament.jpg?1434387283","twitter":"dylans","about":"Dylan Schiemann is CEO of SitePen and co-founder of the Dojo Toolkit.","location":"Everywhere"},{"name":"Brian Lonsdorf","profilePic":"http://cfp.connect-js.com/system/avatars/301/large/28562.jpg?1462416934","twitter":"drboolean","about":"Brian Lonsdorf is functional programmer who uses JavaScript all day at work. Sometimes he is known as that “underscore talk guy” or the author of the Mostly Adequate Guide to Functional Programming. He is a Frontend master™, a panelist on jsair, makes stop motion videos, and writes his own bios.","location":"Everywhere"},{"name":"Ben Vinegar","profilePic":"http://cfp.connect-js.com/system/avatars/270/large/ben-avatar.jpg?1436822986","twitter":"bentlegen","about":"Ben Vinegar is a software engineer at Sentry, and the co-author of Third-party JavaScript. He lives and works in San Francisco.\r\n","location":"Everywhere"},{"name":"Ashley Grant","profilePic":"http://cfp.connect-js.com/system/avatars/429/large/headshot.jpg?1471371821","twitter":"ashleymgrant","about":"Ashley is a full stack web developer from Tallahassee, FL with over ten years of industry experience. Ashley blogs at http://aurelia.ninja on whatever is bugging him this week. He is passionate about showing just how awesome Modern JavaScript development can be! As Aurelia's Community Lead, Ashley focuses on community outreach and making sure everyone knows that their voice matters in the future of the web.","location":"Everywhere"},{"name":"Abraham Williams","profilePic":"http://cfp.connect-js.com/system/avatars/377/large/bendyworks.jpg?1467067803","twitter":"abraham","about":"An experienced developer and start-up founder, Abraham Williams brings a broad range of skills to his current role as a senior developer at Bendyworks.  A top 1% contributor at Stack Overflow and an active member of Google Developer Groups, Abraham has been recognized by Google as a Developer Expert for his ability to identify technology problems and provide quality solutions in the community.","location":"Everywhere"},{"name":"Pearl Latteier","profilePic":"http://cfp.connect-js.com/system/avatars/349/large/8KZZ-jKB_400x400.jpg?1470082018","twitter":"@pblatteier","about":"Pearl Latteier is a software engineer at Bendyworks in Madison WI. For the past several years, she has focused primarily on building data-intensive JavaScript applications for web and mobile, most recently with React JS and React Native. She is also experienced with server-side technologies including Ruby on Rails, Node, and PHP. Before becoming a software developer, Pearl earned a PhD in from the University of Wisconsin-Madison, where for five years she taught courses in the Department of Communication Arts.","location":"Everywhere"},{"name":"Andrew Smith","profilePic":"http://cfp.connect-js.com/system/avatars/284/large/IMG_0061.jpg?1439213242","twitter":"andrew_codes","about":"Software craftsman, Agile enthusiast and practitioner of TDD, I am passionate about creating quality software. As a strong subscriber to the SOLID principles and TDD, I strive to develop with agility. A student at heart, I also teach to aid others in their journey. I firmly believe in continual growth and am constantly in pursuit of improvement in all things I do.","location":"Everywhere"},{"name":"Taggart Bowen-Gaddy","profilePic":"http://cfp.connect-js.com/system/avatars/283/large/me.jpg?1438816304","twitter":"taggartbg","about":"Taggart is a front end developer passionate about the future of the browser and building powerful web applications.  He is a believer in declarative, functional, human-readable code and abstractions that make our lives as developers easier.","location":"Everywhere"},{"name":"Ben Ilegbodu","profilePic":"http://cfp.connect-js.com/system/avatars/316/large/headshot.jpg?1463266052","twitter":"benmvp","about":"Ben is a Christian, a husband and a father with over 10 years of experience developing for the Web. He currently is a Senior UI Engineer on Eventbrite’s Frontend Platform team. On the side, Ben also enjoys playing basketball, watching movies, and <a href=\"http://www.benmvp.com/\">blogging</a> / <a href=\"https://twitter.com/benmvp\">tweeting</a> about his experiences with new web development technologies.","location":"Everywhere"},{"name":"Brian Douglas","profilePic":"http://cfp.connect-js.com/system/avatars/422/large/AAEAAQAAAAAAAAIcAAAAJGE5OWU4M2NhLTJlMGItNGUxZi04ZTBiLThmNjUwMDc0Y2E2Zg.jpg?1470683472","twitter":"bdougieYO","about":"Brian is a Full Stack Developer at Netlify. In his spare time, he is a podcast host on <a href=\"https://www.thisdevelopingstory.com/\">This Developing Story</a>. He got his start in Ruby a few years back, but has recently jumped onto the JavaScript train. He is also a Kanye West apologist and not ashamed about it.","location":"Everywhere"},{"name":"Kent C. Dodds","profilePic":"http://cfp.connect-js.com/system/avatars/299/large/photo.png?1470863915","twitter":"kentcdodds","about":"I am Kent C. Dodds. I work at PayPal as a full stack JavaScript engineer. I host JavaScript Air, the live video broadcast podcast about JavaScript and the web platform. I spend a bit of time on GitHub and Twitter. I’m an Egghead.io instructor and Google Developer Expert. I’m happily married and the father of three kids. I like code. I care about craft, design, tools, and architecture. I like to talk about it. Come chat with me :-)","location":"Everywhere"},{"name":"Clint Ayres","profilePic":"http://cfp.connect-js.com/system/avatars/113/large/1869117.jpeg?1409065085","twitter":"@who_cayres","about":"I'm a front end web developer for <a href=\"http://www.theice.com\">ICE</a> here in Atlanta. I've been working with React for since beginning of 2014. I advocate FLUX and Immutable data when working with React. I am always looking for new patterns that further separate concerns in React components.  This conference I hope to share all the lessons learned from the past two years and explain how to build high performance and maintainable React applications.","location":"Everywhere"},{"name":"Ben Ilegbodu","profilePic":"http://cfp.connect-js.com/system/avatars/316/large/headshot.jpg?1463266052","twitter":"benmvp","about":"Ben is a Christian, a husband and a father with over 10 years of experience developing for the Web. He currently is a Senior UI Engineer on Eventbrite’s Frontend Platform team. On the side, Ben also enjoys playing basketball, watching movies, and <a href=\"http://www.benmvp.com/\">blogging</a> / <a href=\"https://twitter.com/benmvp\">tweeting</a> about his experiences with new web development technologies.","location":"Everywhere"},{"name":"Jeremy Likness","profilePic":"http://cfp.connect-js.com/system/avatars/295/large/jeremy.jpeg?1471267133","twitter":"jeremylikness","about":"Jeremy is the director of application development and principal architect at iVision, a technology services company that leverages data center, converged infrastructure, engineering support services, delivery assurance, and application development practices to engineer the future for clients, today. Jeremy wrote his first program in 1982, was recognized in the \"who's who in Quake\" list for programming the first implementation of \"Midnight Capture the Flag\" in Quake C and has been developing enterprise applications for 20 years. For the past 15 years he has specialized in web-based delivery of line of business applications. Jeremy is the author of four technology books, a six year Microsoft MVP for Windows Platform Development, a Telerik Kendo UI Developer Expert, and speaks and writes regularly on web-based topics such as AngularJS. Jeremy is vegan and spends most of his free time running, hiking and camping with his family, watching retro science fiction movies with his daughter and playing 9-ball and one pocket.","location":"Everywhere"},{"name":"Corinna Cohn","profilePic":"http://cfp.connect-js.com/system/avatars/307/large/T0EI7otn.jpg?1462828137","twitter":"corinna000","about":"Corinna Cohn has been creating websites since 1995 and has written web apps for radio stations, research projects, scientific publishing, and business-to-business clients. Over the past several years, Corinna has worked with Backbone, Ember, and Angular to design and write single-page applications. Corinna has written ugly, unmaintainable code but is now working to bring the principles of clean code, unit tests, and high-quality refactoring into the realm of JavaScript web application","location":"Everywhere"},{"name":"K. Devin McIntyre","profilePic":"http://cfp.connect-js.com/system/avatars/417/large/Karli_Devin_McIntyre.jpg?1472153944","twitter":"","about":"","location":"Everywhere"},{"name":"Peter Pavlovich","profilePic":"http://cfp.connect-js.com/system/avatars/419/large/64456_Pavlovich_20140627_120036_medium_sq.jpg?1469831184","twitter":"ppavlovich","about":"Peter is the Chief Architect at Dispatch Technologies, developers of the most powerful on-demand services platform and is based in Boston, MA.\r\n\r\nBefore joining Dispatch, Peter was the Principal Architect for EnerNOC Labs, a dedicated R&D group within EnerNOC, a Global provider of Demand Response and Energy Inteligence software located in Boston, MA. \r\nPrior to EnerNOC, Peter was a Principal Cloud Engineer with Kronos Incorporated, a global provider of on-premise and cloud-based workforce management solutions. Before Kronos, Peter held the position of Technical Director with Brokat Technologies, a global provider of mobile payment solutions. Prior to that, Peter was a Sr. Architect with GemStone Systems, providing distributed, enterprise-ready data grid and object persistence solutions and J2EE application server technologies.","location":"Everywhere"},{"name":"Minko Gechev","profilePic":"http://cfp.connect-js.com/system/avatars/394/large/yGOHDb0M_400x400.jpg?1470164959","twitter":"mgechev","about":"Minko is a functional time-traveler and freelance software engineer with a passion for open source. He loves to experiment with theoretical concepts and apply them in practice. Minko teaches, speaks and writes about JavaScript and Angular. Some of the projects he works on are “Switching to Angular 2”, codelyzer, angular2-style-guide and many others. Currently changing education with Learn Capital.\r\n","location":"Everywhere"},{"name":"Jad Joubran","profilePic":"http://cfp.connect-js.com/system/avatars/368/large/Jad_Joubran.jpg?1466704515","twitter":"JoubranJad","about":"Very early on, at the age of 19, Jad Joubran founded <a href=\"https://www.etobb.com\">eTobb</a>. Nowadays, his experience mentoring developers across different channels, and coaching Web Development in <a href=\"https://www.lewagon.com/amsterdam\">Amsterdam</a>, <a href=\"https://www.lewagon.com/brussels\">Brussels</a> & <a href=\"https://www.lewagon.com/lisbon\">Lisbon</a>with Le Wagon.","location":"Everywhere"},{"name":"Billy Hoffman","profilePic":"http://cfp.connect-js.com/system/avatars/423/large/hs_billy.jpg?1470060867","twitter":"@zoompf","about":"<p>\r\nFrom hacking into sites as a penetration tester, to optimizing performance for the Fortune 500, Billy has over a decade of deep technical experience into the inner workings of complex web applications. Billy was the lead researcher at the web security software company SPI Dynamics, where he developed and automated new techniques to exploit web vulnerabilities, and spoke extensively at conferences such as BlackHat and RSA about his findings. Following SPI’s acquisition by Hewlett-Packard in 2007, Billy managed HP’s web security research group. Billy founded the web performance company Zoompf in late 2009 where he developed the industry’s first site-wide performance analysis product which tells you the root-cause of your performance issues. He has spoken at industry conferences such as Velocity and has been a contributing author for O’Reilly’s Web Performance Daybook. At Rigor, Billy is the Director of Product where he focuses on delivering best-in-class performance software.\r\n</p>","location":"Everywhere"},{"name":"Ian Moraes","profilePic":"http://cfp.connect-js.com/system/avatars/409/large/ian-moraes.png?1470164523","twitter":"@imoraes","about":"Ian Moraes, Ph.D., is a Senior Director, Technology at Turner where he leads web development teams at CNN. Ian has led the development of large-scale solutions for both small and large companies, presented at industry events, and written articles on a broad range of technology ","location":"Everywhere"},{"name":"James Simpson","profilePic":"http://cfp.connect-js.com/system/avatars/378/large/james_headshot.png?1469990016","twitter":"GoldFireStudios","about":"James Simpson has spent the greater part of his life pushing the web forward by challenging what is possible in a browser. As founder of <a href=\"http://goldfirestudios.com\">GoldFire Studios</a>, he has focussed on real-time gaming, high scalability/performance and one of the largest HTML5 canvas games ever built. He is also passionate about open-source as the author of several projects, including the popular howler.js audio library.","location":"Everywhere"},{"name":"Jordan Kasper","profilePic":"http://cfp.connect-js.com/system/avatars/106/large/jordan_bw_large.jpg?1468351188","twitter":"jakerella","about":"Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming. Jordan's experience includes development at startups, agencies, Fortune 100 companies, and universities, as well as numerous open source projects. He has coded in many languages from BASIC to Java to PHP and most recently JavaScript and Node.js. He speaks regularly at (and helps organize) local user groups, conferences large and small, and hackathons. Jordan's primary mission for over 10 years has been to evangelize technology of all sorts and share what he has learned to help others grow. He is currently a front-end engineering instructor with The Iron Yard in Washington, DC. In his down time he enjoys puzzles of all sorts and board games!","location":"Everywhere"},{"name":"Rachita Joshi","profilePic":"http://cfp.connect-js.com/system/avatars/335/large/Rachita_Joshi.jpeg?1473260340","twitter":"@way2rach","about":"I have a keen interest in the Front-End Architecture. I am currently leading the efforts to standardize and move the Front-End Architecture for our product to BEM Methodology. ","location":"Everywhere"},{"name":"Brian Rinaldi","profilePic":"http://cfp.connect-js.com/system/avatars/23/large/P1012644_b.jpg?1464886390","twitter":"remotesynth","about":"Brian Rinaldi is the Developer Programs Manager at Progress where he manages the Telerik Developer Network. Brian is a frequent speaker and and serves as co-editor of the Mobile Web Weekly newsletter. He is the author of the Static Site Generators report available from O'Reilly.","location":"Everywhere"},{"name":"Tamil Periasamy","profilePic":"http://cfp.connect-js.com/system/avatars/205/large/a2c776f9214d186b15b26d08fe0e6023_400x400.jpeg?1470165086","twitter":"tsperiasamy","about":"","location":"Everywhere"},{"name":"Nicole Saidy","profilePic":"http://cfp.connect-js.com/system/avatars/421/large/VEkaR3Qf.jpg?1469982103","twitter":"nicolesaidy","about":"I'm a web designer with a passion for creating beautiful design solutions for the digital world with knowledge in web, mobile, front-end development & more.","location":"Everywhere"},{"name":"Jad Joubran","profilePic":"http://cfp.connect-js.com/system/avatars/368/large/Jad_Joubran.jpg?1466704515","twitter":"JoubranJad","about":"Very early on, at the age of 19, Jad Joubran founded <a href=\"https://www.etobb.com\">eTobb</a>. Nowadays, his experience mentoring developers across different channels, and coaching Web Development in <a href=\"https://www.lewagon.com/amsterdam\">Amsterdam</a>, <a href=\"https://www.lewagon.com/brussels\">Brussels</a> & <a href=\"https://www.lewagon.com/lisbon\">Lisbon</a>with Le Wagon.","location":"Everywhere"},{"name":"Josh Teague","profilePic":"http://cfp.connect-js.com/system/avatars/408/large/josh.jpeg?1468420207","twitter":"joshteague","about":"Head of Design at FullStory, previously at Google.","location":"Everywhere"},{"name":"Stephanie Brubaker","profilePic":"http://cfp.connect-js.com/system/avatars/321/large/headshot.jpg?1468349802","twitter":"@sjbrubaker","about":"Stephanie Brubaker is a full stack engineer at FullStory, a Customer Success platform that lets companies easily record, replay, search, and analyze each user’s actual experience with their website. With a primary focus on frontend web development, she works closely with the FullStory design team to turn their brilliant designs into high-leverage UIs. Stephanie was previously an engineer at Google, where she worked on the Google Web Toolkit and complex version control systems. She has a CS Masters degree from Georgia Tech and finds soldering fun and relaxing.","location":"Everywhere"},{"name":"Nicole Saidy","profilePic":"http://cfp.connect-js.com/system/avatars/421/large/VEkaR3Qf.jpg?1469982103","twitter":"nicolesaidy","about":"I'm a web designer with a passion for creating beautiful design solutions for the digital world with knowledge in web, mobile, front-end development & more.","location":"Everywhere"},{"name":"Andrew Malek","profilePic":"http://cfp.connect-js.com/system/avatars/201/large/twitter-photo.png?1463362661","twitter":"malekontheweb","about":"Andrew is a UI developer and occasional designer at NCR, focusing on POS (point-of-sale) and clienteling solutions. He has two decades of development experience in languages such as JavaScript, Visual Basic, Python, and C, and will admit to having developed a content management solution with Delphi and Perl if backed into a corner.","location":"Everywhere"},{"name":"Grant Davies","profilePic":"http://cfp.connect-js.com/system/avatars/305/large/Grant_Davies.jpg?1467135938","twitter":"@GrantMarkDavies","about":"Grant Davies, CEO of Bluetube, has an extensive background in technology development with a passion for researching and predicting future technology trends. Before founding Bluetube in 1999, Grant worked for two decades as a developer and architect. Since then, he’s built innovate digital solutions for global 2000, nonprofit and mid-market clients in industries including healthcare, manufacturing, consumer products, arts and entertainment.","location":"Everywhere"},{"name":"Emily Stamey","profilePic":"http://cfp.connect-js.com/system/avatars/309/large/phpwomen-large-2015-10-01_12.45.18.jpg?1471011550","twitter":"elstamey","about":"Emily is a developer at NC State, building and supporting applications for the College of Engineering. She learned PHP in 1999 and loved it.  This ignited her passion for Open Source! In her free time she enjoys music, legos, making things, playing games, and socializing. She is an active volunteer in the community as an Organizer of TrianglePHP and Girl Develop It. She enjoys helping people share ideas and learn together, which has led to her speaking at conferences.","location":"Everywhere"},{"name":"Eli White","profilePic":"http://cfp.connect-js.com/system/avatars/392/large/eli_beardhawk.jpg?1467514859","twitter":"EliW","about":"Eli has been building Web Applications for 20 years and fell in love with PHP the day that PHP 4 was released. Since then he's been a strong advocate for PHP and used it in every project he's worked on.  He is currently the Vice President of One for All Events LLC, and Conference Chair for php[architect]. He is a strong advocate for \"Just getting it done\" when it comes to coding, and speaks at numerous conferences each year.","location":"Everywhere"},{"name":"Chris Church","profilePic":"http://cfp.connect-js.com/system/avatars/320/large/chris_church_headshot.png?1469976368","twitter":"","about":"I lead systems engineering and architecture at Patientco, a healthcare payment technology company.  I ensure that Patientco’s SaaS solution operates reliably, securely, and seamlessly.","location":"Everywhere"},{"name":"Anthony Green","profilePic":"http://cfp.connect-js.com/system/avatars/379/large/11fa56e.jpg?1468856629","twitter":"avastechnology","about":"Anthony is the lead developer at AVAS Technology, where he focuses on building web applications for situations where data security is of the utmost importance. He works primarily in PHP, having experience with most of the major content management systems and frameworks in the language. Most of his time is now focused on developing on the StoneHilt platform.","location":"Everywhere"},{"name":"Paul M. Jones","profilePic":"http://cfp.connect-js.com/system/avatars/158/large/IMG_3665-sq.jpg?1467209991","twitter":"pmjones","about":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","location":"Everywhere"},{"name":"Eli White","profilePic":"http://cfp.connect-js.com/system/avatars/392/large/eli_beardhawk.jpg?1467514859","twitter":"EliW","about":"Eli has been building Web Applications for 20 years and fell in love with PHP the day that PHP 4 was released. Since then he's been a strong advocate for PHP and used it in every project he's worked on.  He is currently the Vice President of One for All Events LLC, and Conference Chair for php[architect]. He is a strong advocate for \"Just getting it done\" when it comes to coding, and speaks at numerous conferences each year.","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Parashuram","profilePic":"http://cfp.connect-js.com/system/avatars/322/large/me.png?1463935638","twitter":"nparashuram","about":"","location":"Everywhere"},{"name":"Mike Hartington","profilePic":"http://cfp.connect-js.com/system/avatars/216/large/mike-headshot.png?1435605936","twitter":"@mhartington","about":"Ionic Developer, open source contributor, beer lover. Based out of beautiful Rhode Island.","location":"Everywhere"},{"name":"Dr. Doris Chen","profilePic":"http://cfp.connect-js.com/system/avatars/236/large/Doris_pro_3.jpg?1467060663","twitter":"@doristchen","about":"Doris is a Senior Technology Evangelist at Microsoft for the Western region of the United States, specialized in web technologies (HTML5, jQuery, JavaScript, Ajax, and Java).  \r\nDoris has over 18 years of experience in the software industry working in several open source web tier technologies, Java platform, .NET and distributed computing technologies. She has developed and delivered over 400 keynotes, technical sessions, and trainings worldwide. She speaks at numerous international conferences and user groups including O’Reilly OSCON, Fluent, Dev Nexus, HTML5 Dev Conference, WebVisions,  JavaOne, SD Forum, and worldwide User Groups. Doris works very closely to create and foster the open source community around Java, NetBeans, Glassfish, and related technologies. Before joining Microsoft, Doris Chen was a Technology Evangelist at Sun Microsystems.\r\nDoris received her Ph.D. from the University of California at Los Angeles (UCLA) in computer engineering, specializing in medical informatics. ","location":"Everywhere"},{"name":"Jen Looper","profilePic":"http://cfp.connect-js.com/system/avatars/345/large/jlooper_sm.jpg?1465931599","twitter":"jenlooper","about":"Jen Looper is a Developer Advocate at Telerik with over 13 years' experience as a web and mobile developer, specializing in creating cross-platform educational and fitness-oriented mobile apps. She's a multilingual multiculturalist with a passion for hardware hacking and learning new things every day. Visit her online at http://www.ladeezfirstmedia.com, or via Twitter @jenlooper.","location":"Everywhere"},{"name":"Dan Callahan","profilePic":"http://cfp.connect-js.com/system/avatars/403/large/avatar.jpg?1468336677","twitter":"callahad","about":"Dan Callahan is a Staff Software Engineer in Mozilla's Developer Relations team, where he focuses on Firefox add-ons and the Servo parallel browser engine project. Dan previously worked on the Mozilla Persona project, an attempt at replacing passwords with user-friendly public key cryptography built on open web standards. Dan tweets as @callahad and swears he has every intention to blog at https://dancallahan.info.callahad","location":"Everywhere"},{"name":"Alicia V Carr","profilePic":"http://cfp.connect-js.com/system/avatars/355/large/AAEAAQAAAAAAAAP7AAAAJGJmYWJjOTg0LTkzZTYtNDg2Yi1iNmQ0LWU5MGI1MGZlZDFlZA.jpg?1470164194","twitter":"https://twitter.com/Fineblkwoman","about":"I'm the first black woman iOS Developer that was feature in an Apple WWDC16 promotional video.","location":"Everywhere"},{"name":"Shawn Johnson","profilePic":"http://cfp.connect-js.com/system/avatars/416/large/me.jpg?1469047093","twitter":"digitalsleep","about":"Lover of all things mobile. Founding Hero @ Mobile App Hero, Mobile Instructor @ Gerneral Assembly.   ","location":"Everywhere"},{"name":"Marcus Smith","profilePic":"http://cfp.connect-js.com/system/avatars/385/large/54b3eF5m_400x400.jpg?1468857003","twitter":"@antsifyoudo","about":"iOS Developer at stable|kernel in Atlanta.","location":"Everywhere"},{"name":"Jesse Black","profilePic":"http://cfp.connect-js.com/system/avatars/383/large/JesseB.jpg?1467295442","twitter":"@JesseBlack82","about":"Jesse Black brings nine years of programming experience to stable|kernel as a software engineer. His passion for programming stems from a love of logic and a need to automate tedious paperwork responsibilities while working for his family’s business. Jesse has a bachelor’s degree in mathematics from New York University. When he's not solving clients needs, he enjoys dusting off old mathematics textbooks, learning Dart and going to see live music.","location":"Everywhere"},{"name":"Florian Harr","profilePic":"http://cfp.connect-js.com/system/avatars/382/large/Florian_Harr.png?1467313299","twitter":"@EvilsX","about":"Florian Harr is a software engineer specializing in iOS at an Atlanta-based, mobile app development company called stable|kernel. Since working for stable|kernel in early 2016, he has worked on multiple client projects that expanded his iOS, IoT and project management skills. In his free time, he’s a scuba diver and an electric unicycle driver.  ","location":"Everywhere"},{"name":"Carol Shepherd","profilePic":"http://cfp.connect-js.com/system/avatars/390/large/carol.jpg?1467396249","twitter":"walkingthedogs","about":"Carol is an Enterprise Mobile Application Designer/Developer for CBS Corporate IT. She doesn't have an app in the App Store or an open source project in GitHub and probably never will. Her projects are intended for use within the walled garden that pampers corporate professionals. She has worked as a professional in the IT industry since her sophomore year in college. She holds a BS in Computer Science with an emphasis in Artificial Intelligence and MS in Information Design and Communication. If you'd like to start a personal conversation ask her about her hobby -- raising Flemish Giant rabbits. ","location":"Everywhere"},{"name":"Jennifer Bland","profilePic":"http://cfp.connect-js.com/system/avatars/332/large/JenniferBland.png?1466081762","twitter":"ratracegrad","about":"Jennifer Bland is a Software Developer for CNN, specializing in MEAN stack development. She has more than ten years of development experience. Jennifer is the author of the book “Developing e-Business Applications Using Lotus Domino on the AS/400\", published by IBM. ","location":"Everywhere"},{"name":"Leif Wells","profilePic":"http://cfp.connect-js.comnull","twitter":"leifwells","about":"<p>Leif Wells is a web, mobile and desktop application developer living in Atlanta, Georgia. Having spent decades in development, Leif provides insight into his experiences at his blog. <a href=\"https://leifwells.github.io/blog-o-rama/\">Leif's Development Blog-o-rama</a> as well as speaking at user groups and conferences.</p> ","location":"Everywhere"},{"name":"Matthew Groves","profilePic":"http://cfp.connect-js.com/system/avatars/366/large/mebricks.jpg?1466704010","twitter":"mgroves","about":"Matthew D. Groves is a guy who loves to code and get involved in the developer community.  He is the author of AOP in .NET, and is also a Microsoft MVP.\r\n","location":"Everywhere"},{"name":"James Simpson","profilePic":"http://cfp.connect-js.com/system/avatars/378/large/james_headshot.png?1469990016","twitter":"GoldFireStudios","about":"James Simpson has spent the greater part of his life pushing the web forward by challenging what is possible in a browser. As founder of <a href=\"http://goldfirestudios.com\">GoldFire Studios</a>, he has focussed on real-time gaming, high scalability/performance and one of the largest HTML5 canvas games ever built. He is also passionate about open-source as the author of several projects, including the popular howler.js audio library.","location":"Everywhere"},{"name":"Tara Walker","profilePic":"http://cfp.connect-js.com/system/avatars/412/large/33bceb9f80906c53a9d7c137d4a0a183_400x400.jpeg?1469724863","twitter":"taraw","about":"Tara is a technical evangelist for Amazon Web Services, dedicating her time to help developers build apps, games, and technical solutions in the AWS cloud. Tara has most recently been working on evangelizing mobile, gaming, IoT, serverless backend architectures, and cross-platform development with AWS.  ","location":"Everywhere"},{"name":"Raymond Camden","profilePic":"http://cfp.connect-js.com/system/avatars/329/large/393660.png?1470165031","twitter":"raymondcamden","about":"Raymond Camden is a developer advocate for IBM. His work focuses on the StrongLoop platform, Bluemix, hybrid mobile development, Node.js, HTML5, and web standards in general. He's a published author and presents at conferences and user groups on a variety of topics. Raymond can be reached at his blog (www.raymondcamden.com), @raymondcamden on Twitter, or via email at raymondcamden@gmail.com.","location":"Everywhere"},{"name":"Douglas Knudsen","profilePic":"http://cfp.connect-js.com/system/avatars/99/large/doug_small_400x400.jpg?1468858447","twitter":"douglasknudsen","about":"As a Team Lead, Douglas brings over fifteen years of building highly visible solutions in the enterprise and consumer spaces spanning financial institutions such as Nasdaq to educational stalwarts like Pearson to technology giants like RIM. Douglas is currently focused at delivering mobile solutions on the Android platform as well as dabbling in the vast HTML5 based technological arena. Douglas' background in Mathematics is probably fueling his recent interest in Big Data.  In his off hours, you can find Douglas speaking at local user groups on technology in the Atlanta area when not tutoring his kids in fun Mathematics and Science topics.","location":"Everywhere"},{"name":"Ken Kousen","profilePic":"http://cfp.connect-js.com/system/avatars/420/large/848_Kousen_20110408_052155_medium_sq.jpg?1469900443","twitter":"kenkousen","about":"Ken Kousen is a technical trainer, software developer, and conference speaker specializing in Java and open source topics, including Android, Spring, Hibernate/JPA, Groovy, Grails, and Gradle. He is the author of the O'Reilly book “Gradle Recipes for Android” and the Manning book “Making Java Groovy”. He also has recorded several video courses for O'Reilly, including two on Android, three on Groovy, two on Gradle, one on Advanced Java, and one on the Spring Framework.","location":"Everywhere"},{"name":"Ken Kousen","profilePic":"http://cfp.connect-js.com/system/avatars/420/large/848_Kousen_20110408_052155_medium_sq.jpg?1469900443","twitter":"kenkousen","about":"Ken Kousen is a technical trainer, software developer, and conference speaker specializing in Java and open source topics, including Android, Spring, Hibernate/JPA, Groovy, Grails, and Gradle. He is the author of the O'Reilly book “Gradle Recipes for Android” and the Manning book “Making Java Groovy”. He also has recorded several video courses for O'Reilly, including two on Android, three on Groovy, two on Gradle, one on Advanced Java, and one on the Spring Framework.","location":"Everywhere"},{"name":"Lance Gleason","profilePic":"http://cfp.connect-js.com/system/avatars/78/large/lance.jpg?1468856973","twitter":"lgleasain","about":"A computer nut since he was a kid, Lance Gleason is the founder and president of Polyglot Programming, a boutique consultancy firm that focuses on mobile and wearable software development. Lance previously worked as a Java developer and software architect for organizations such as Kodak, CNN, and GE. He is a frequent speaker at tech conferences worldwide and is the co-organizer of the Atlanta Sensors and Startups Meetup, Atlanta GDG, Ruby DCamp ZA, and Rubyfuza, the only Ruby conference in Africa. He is known to practice interspecies pair (purr) programming with his orange tabby, Allie, and when he’s not writing code, Lance might be diving with sharks, trekking through Chernobyl, sampling wine, cheering on the Springboks, or perfecting his biltong recipe.","location":"Everywhere"},{"name":"Kristin Marsicano","profilePic":"http://cfp.connect-js.com/system/avatars/424/large/Kristin_Marsicano.jpg?1470080418","twitter":"kristinmars","about":"Kristin Marsicano is an Android developer at Big Nerd Ranch, and the co-author of Android Programming: The Big Nerd Ranch Guide.  Prior to working at Big Nerd Ranch, Kristin spent five years teaching introductory Computer Science courses at Georgia Tech.  Always an educator at heart, she is passionate about learning, software development, and the intersection of the two.  When she is not teaching or developing apps, you can find Kristin cooking for her growing family, doing yoga, or learning something new (like gardening).","location":"Everywhere"},{"name":"Joe Conway","profilePic":"http://cfp.connect-js.com/system/avatars/361/large/SK.Headshots.2015-4.jpg?1466606300","twitter":"joeconwaystk","about":"Joe Conway is the founder and CEO of stable|kernel, an Atlanta-based mobile software company offering end-to-end development services to craft smartly-designed mobile applications that connect brands directly with their users – across tablets, smartphones, desktops, wearables and the Internet of Things. For the past 16 years, Joe has programmed everything from Mac OS X to Android to iOS. As a former instructor and lead developer at Big Nerd Ranch, he fine-tuned his skills and expertise in overall mobile strategy, specializing in iOS Development. The author of iOS Programming: The Big Nerd Ranch Guide, an Amazon best seller, Joe quickly made a name for himself in the mobile space. He has worked with Fortune 500 companies, technology start-ups and government entities to build mobile platforms, enhance existing applications and develop mobile strategies.","location":"Everywhere"},{"name":"Nick Larsen","profilePic":"http://cfp.connect-js.com/system/avatars/374/large/me-everywhere.JPG?1466988825","twitter":"fody","about":"Nick Larsen is a performance oriented developer for the Stack Overflow data team.  He is a husband, a father and graduate student at GA Tech.","location":"Everywhere"},{"name":"Giovanny Gongora","profilePic":"http://cfp.connect-js.com/system/avatars/393/large/GtqX4JQj.jpg?1469921801","twitter":"Gioyik","about":"I'm Giovanny Gongora, aka Gioyik. I am Porting Developer at Mozilla. Javascriptero since creation of the universe. Time ago translator at Tor Project and Security tester. I enjoy trying new things like Rust and Go, sometimes creating custom languages and working on my own projects.\r\n\r\nI give talks about web technologies, open source, net neutrality, programming languages that suck and how cats will control the world in the future.","location":"Everywhere"},{"name":"Jonathan Martin","profilePic":"http://cfp.connect-js.com/system/avatars/72/large/avatar.png?1408041461","twitter":"nybblr","about":"<p>Jonathan is a cheesecake-loving Developer &amp; Instructor at <a href=\"https://www.bignerdranch.com/\">Big Nerd Ranch</a>, where he sheds bikes in Rails or bores students with the “wats” of JavaScript in the Ranch’s immersive front-end bootcamp.</p>","location":"Everywhere"},{"name":"Burk Hufnagel","profilePic":"http://cfp.connect-js.com/system/avatars/233/large/Burk_120x150.jpg?1435685376","twitter":"@BurkHufnagel","about":"Burk is a long-time programmer and software architect, with experience in multiple languages including Java and JavaScript. He’s presented at multiple conferences including DevNexus and JavaOne, and contributed to two of the “97 Things” books published by O’Reilly. He works as a Technical Architect for Daugherty Business Solutions where he's focused on finding ways to deliver better code in less time, teaching others how to do the same thing, and looking for ways to improve his skills and the skills of his team.","location":"Everywhere"},{"name":"Patrick Seda","profilePic":"http://cfp.connect-js.com/system/avatars/75/large/pxtrickAtThatConference_crop.jpg?1431977585","twitter":"pxtrick","about":"Patrick is CTO of Colligo Vox, a Mobile solutions consulting company based out of Atlanta. With over 25 years of professional experience, he orchestrates and implements successful mobile initiatives. Ranging from enterprise behemoth applications to children’s educational games, his focus is delivering bullet-proof, awesomely kickass apps.","location":"Everywhere"},{"name":"Janelle Klein","profilePic":"http://cfp.connect-js.com/system/avatars/426/large/64077_Klein_20160620_181347_medium_sq.jpg?1470165299","twitter":"janellekz","about":"Janelle is author of the book, Idea Flow: How to Measure the PAIN in Software Development (leanpub.com/ideaflow), and founder of Open Mastery (openmastery.org), an industry peer mentorship network focused on data-driven software mastery.\r\n\r\nShe founded Open Mastery to rally the industry in working together, and learning together to break down the wall of ignorance between managers and developers that drives our software projects into the ground. By making the pain visible with Idea Flow, we have a universal definition of effective practice, a universal language for sharing our experiences, and an opportunity to learn together like never before. Open Mastery is about taking the industry to a whole new level of effectiveness by working together.\r\n\r\nAside from Open Mastery, Janelle has been working with New Iron for the last 10 years, as a developer, consultant, and now as CTO. Her development background is specialized in data-intensive analytic systems from financial core processors to factory automation, supply chain optimization and statistical process control (SPC). Her consulting work has focused on Continuous Delivery infrastructure, database automation, test automation strategies, and helping companies identify and solve their biggest problems.","location":"Everywhere"},{"name":"John Mercer","profilePic":"http://cfp.connect-js.com/system/avatars/413/large/good_pic_headshot.jpg?1471110711","twitter":"jfmercer","about":"","location":"Everywhere"},{"name":"Bob Holben","profilePic":"http://cfp.connect-js.com/system/avatars/350/large/avatar.jpeg?1466114990","twitter":"@rbholben","about":"Bob is an engineer who's career has centered around R&D and manufacturing in both the physical world and the software world.  With experience launching 3 companies, Bob's recent passion has been with JavaScript and Angular.","location":"Everywhere"},{"name":"Delicia Brummitt","profilePic":"http://cfp.connect-js.com/system/avatars/324/large/300x300.jpg?1470164330","twitter":"","about":"Delicia is a tech generalist that has worked as web designer to DBA, Software Engineer to QA.  With a motto of “Work Smarter not Harder”, she is driven to finding elegant solutions that make life easier. \r\n\r\nDelicia is currently working as a Software Engineer at UPS. \r\n","location":"Everywhere"},{"name":"Chris Morrow","profilePic":"http://cfp.connect-js.com/system/avatars/30/large/img_8658-codecamp.png?1462908476","twitter":"_ChrisMorrow","about":"I'm a Senior UI Developer, currently specializing in Data Visualization at The Weather Company. I constantly seek new coding best practices and workflows. I love to learn and I love to teach. I am thankful for those that helped me learn to code better throughout my career, and I enjoy giving back and helping others. I've used a number of web technologies including JavaScript, NodeJS, AngularJS, KnockoutJS, Aurelia, D3, jQuery, SASS/CSS, HTML, and even Flash, and Flex.","location":"Everywhere"},{"name":"Dylan Schiemann","profilePic":"http://cfp.connect-js.com/system/avatars/182/large/parliament.jpg?1434387283","twitter":"dylans","about":"Dylan Schiemann is CEO of SitePen and co-founder of the Dojo Toolkit.","location":"Everywhere"},{"name":"Jonathan Kemp","profilePic":"http://cfp.connect-js.com/system/avatars/308/large/jonathan-3.JPG?1469755958","twitter":"jonkemp","about":"Jonathan is a Senior Front End Developer at Scripps Networks Interactive working with a team of developers on the websites for their portfolio of popular lifestyle brands including HGTV, DIY Network, and Great American Country.","location":"Everywhere"},{"name":"Tim Dorr","profilePic":"http://cfp.connect-js.com/system/avatars/317/large/me3.square.jpg?1466472788","twitter":"timdorr","about":"Tim is CTO at Showcase IDX. His open source work with React Community (formerly Rackt) focuses on React Router, Redux and webpack-preset. He also reverse-engineered the Tesla Model S API so he can control his car from his watch. Hailing from Atlanta, you may catch him around town DJing your favorite party or biking along the Silver Comet Trail.","location":"Everywhere"},{"name":"Brian Vaughn","profilePic":"http://cfp.connect-js.com/system/avatars/327/large/29597.jpeg?1469735630","twitter":"brian_d_vaughn","about":"Front-end engineer and song-writer. Working with React at Treasure Data; formerly working with Angular at Google.","location":"Everywhere"},{"name":"Jonathan Kemp","profilePic":"http://cfp.connect-js.com/system/avatars/308/large/jonathan-3.JPG?1469755958","twitter":"jonkemp","about":"Jonathan is a Senior Front End Developer at Scripps Networks Interactive working with a team of developers on the websites for their portfolio of popular lifestyle brands including HGTV, DIY Network, and Great American Country.","location":"Everywhere"},{"name":"Kevin Old","profilePic":"http://cfp.connect-js.com/system/avatars/325/large/kold_avatar.jpg?1469988351","twitter":"kevinold","about":"Kevin Old is a full stack, but frontend focused, Senior Software Engineer living White House, TN. He's a huge fan of coffee, micro-roasters and the entire ecosystem around single origin coffee. When he is not developing software he enjoys spending time with his wife, 2 sons, 2 dachshunds and cat.","location":"Everywhere"},{"name":"John Mercer","profilePic":"http://cfp.connect-js.com/system/avatars/413/large/good_pic_headshot.jpg?1471110711","twitter":"jfmercer","about":"","location":"Everywhere"},{"name":"Peter Pavlovich","profilePic":"http://cfp.connect-js.com/system/avatars/419/large/64456_Pavlovich_20140627_120036_medium_sq.jpg?1469831184","twitter":"ppavlovich","about":"Peter is the Chief Architect at Dispatch Technologies, developers of the most powerful on-demand services platform and is based in Boston, MA.\r\n\r\nBefore joining Dispatch, Peter was the Principal Architect for EnerNOC Labs, a dedicated R&D group within EnerNOC, a Global provider of Demand Response and Energy Inteligence software located in Boston, MA. \r\nPrior to EnerNOC, Peter was a Principal Cloud Engineer with Kronos Incorporated, a global provider of on-premise and cloud-based workforce management solutions. Before Kronos, Peter held the position of Technical Director with Brokat Technologies, a global provider of mobile payment solutions. Prior to that, Peter was a Sr. Architect with GemStone Systems, providing distributed, enterprise-ready data grid and object persistence solutions and J2EE application server technologies.","location":"Everywhere"},{"name":"Jad Joubran","profilePic":"http://cfp.connect-js.com/system/avatars/368/large/Jad_Joubran.jpg?1466704515","twitter":"JoubranJad","about":"Very early on, at the age of 19, Jad Joubran founded <a href=\"https://www.etobb.com\">eTobb</a>. Nowadays, his experience mentoring developers across different channels, and coaching Web Development in <a href=\"https://www.lewagon.com/amsterdam\">Amsterdam</a>, <a href=\"https://www.lewagon.com/brussels\">Brussels</a> & <a href=\"https://www.lewagon.com/lisbon\">Lisbon</a>with Le Wagon.","location":"Everywhere"},{"name":"Josh Marinacci","profilePic":"http://cfp.connect-js.com/system/avatars/331/large/8jnfa4d7lb6bwim5jri6_400x400.jpeg?1468351548","twitter":"joshmarinacci","about":"Josh is an O’Reilly author, developer advocate, and recovering engineer. He is the technical marketing manager at PubNub. Previously he worked as a developer evangelist at Nokia, Palm / HP, and Sun. He is passionate about user interfaces and education. Josh lives in sunny Eugene, Oregon.","location":"Everywhere"},{"name":"Minko Gechev","profilePic":"http://cfp.connect-js.com/system/avatars/394/large/yGOHDb0M_400x400.jpg?1470164959","twitter":"mgechev","about":"Minko is a functional time-traveler and freelance software engineer with a passion for open source. He loves to experiment with theoretical concepts and apply them in practice. Minko teaches, speaks and writes about JavaScript and Angular. Some of the projects he works on are “Switching to Angular 2”, codelyzer, angular2-style-guide and many others. Currently changing education with Learn Capital.\r\n","location":"Everywhere"},{"name":"Dee Del Rosario","profilePic":"http://cfp.connect-js.com/system/avatars/395/large/Dannielle_Del_Rosario.png?1467753301","twitter":"dirosaur","about":"Dee Del Rosario is a web developer, visual artist and community organizer in video games. Currently, she works as a software engineer at Big Nerd Ranch in Atlanta. Her interests include travel, digital media, and pastries.","location":"Everywhere"},{"name":"Keith J Grant","profilePic":"http://cfp.connect-js.com/system/avatars/116/large/avatar.jpg?1433426633","twitter":"keithjgrant","about":"I am a Senior Web Developer at Intercontinental Exchange, where, among other things, I wrote and maintain the CSS for The New York Stock Exchange. I am the author of <a href=\"https://manning.com/books/css-in-depth\">CSS in Depth</a>.","location":"Everywhere"},{"name":"Wesley Hales","profilePic":"http://cfp.connect-js.com/system/avatars/82/large/velocityspeakers-029-square.png?1408373201","twitter":"wesleyhales","about":"Wesley Hales is an author, occasional speaker and Lead Software Developer at Shape Security.\r\n\r\nIn his spare time, Wesley works on onslyde and loadreport.js.\r\nYou can read his <a href=\"http://wesleyhales.com\">articles</a>, or follow him on twitter <a href=\"http://twitter.com/wesleyhales\">@wesleyhales</a>.","location":"Everywhere"},{"name":"Stephen A Thomas","profilePic":"http://cfp.connect-js.com/system/avatars/27/large/sathomas.me.png?1468351271","twitter":"stephen_thomas","about":"A well-regarded speaker and author on web technology, Stephen is responsible for front end development at Intellum where he leads the effort to create an engaging and accessible user experience on the web.","location":"Everywhere"},{"name":"Erica Stanley","profilePic":"http://cfp.connect-js.com/system/avatars/76/large/headshot_2013.png?1408127992","twitter":"ericastanley","about":"Erica Stanley is a software engineer, researcher and tinkerer. Always eager to explore the intersection of emerging technologies and social science, Erica has worked with various technologies at the heart of virtual, augmented and mixed reality for over 16 years.  She is also passionately working towards gender and multicultural inclusion in tech, via education and exposure to opportunities. Erica co-founded the Atlanta network of Women Who Code and sits on the advisory board of 100 Girls of Code.","location":"Everywhere"},{"name":"Jim Karwisch","profilePic":"http://cfp.connect-js.com/system/avatars/428/large/jimimage.jpg?1470919849","twitter":"@Karwisch","about":"I have been studying and applying improv since 1997 and have worked in the Fortune 500 world from 2001 – 2014. Currently I work with companies to affect cultural change by applying the concepts, tools and skill-sets of improvisation.","location":"Everywhere"},{"name":"Mike Gorgone","profilePic":"http://cfp.connect-js.com/system/avatars/380/large/mikesquare.jpg?1467146679","twitter":"@MikeGorgone","about":"I have 20+ years in the software industry with the last 4 years focused on User Experience Design, collaboratively executing large enterprise-level web initiatives. I enjoy working with teams that, truly create TOGETHER, solutions that best solve the problem at hand. I feel immense pain when I see or use a website with a poor user experience. I want the web to be great and I want my teammates to be great as well and I do everything I can to make them look like Rock Stars.","location":"Everywhere"},{"name":"Josh Marinacci","profilePic":"http://cfp.connect-js.com/system/avatars/331/large/8jnfa4d7lb6bwim5jri6_400x400.jpeg?1468351548","twitter":"joshmarinacci","about":"Josh is an O’Reilly author, developer advocate, and recovering engineer. He is the technical marketing manager at PubNub. Previously he worked as a developer evangelist at Nokia, Palm / HP, and Sun. He is passionate about user interfaces and education. Josh lives in sunny Eugene, Oregon.","location":"Everywhere"},{"name":"Andrew Malek","profilePic":"http://cfp.connect-js.com/system/avatars/201/large/twitter-photo.png?1463362661","twitter":"malekontheweb","about":"Andrew is a UI developer and occasional designer at NCR, focusing on POS (point-of-sale) and clienteling solutions. He has two decades of development experience in languages such as JavaScript, Visual Basic, Python, and C, and will admit to having developed a content management solution with Delphi and Perl if backed into a corner.","location":"Everywhere"},{"name":"Will Jayroe","profilePic":"http://cfp.connect-js.com/system/avatars/336/large/Jayroe-Portrait-by-Ashcraft-20150415-640x640.jpg?1470148290","twitter":"cyb3rllama","about":"<p>Will Jayroe is a multi-disciplinary professional specializing in Solutions Architecture, User Interface and Front-End Technology consulting, User Experience strategy, Visual and Interaction Design.</p>","location":"Everywhere"},{"name":"Larry Garfield","profilePic":"http://cfp.connect-js.com/system/avatars/279/large/larry.jpg?1470145421","twitter":"Crell","about":"Larry Garfield is a software architect, PHP guru, Drupal core developer, Drupal ambassador, correctness nerd, and all around (mostly) lovable pedant on the subjects of software engineering and computer science.","location":"Everywhere"},{"name":"Paul M. Jones","profilePic":"http://cfp.connect-js.com/system/avatars/158/large/IMG_3665-sq.jpg?1467209991","twitter":"pmjones","about":"Internationally-recognized PHP expert; <a href=\"http://php-fig.org\">PHP-FIG</a> founding member; primary author on PSR-1, PSR-2, and PSR-4; author of <a href=\"https://leanpub.com/mlaphp\">Modernizing Legacy Applications in PHP</a>; lead on the <a href=\"http://auraphp.com\">Aura</a> and <a href=\"https://github.com/radarphp/Radar.Project\">Radar</a> projects; defined the <a href=\"http://pmjones.io/adr\">Action-Domain-Responder</a> pattern.","location":"Everywhere"},{"name":"Larry Garfield","profilePic":"http://cfp.connect-js.com/system/avatars/279/large/larry.jpg?1470145421","twitter":"Crell","about":"Larry Garfield is a software architect, PHP guru, Drupal core developer, Drupal ambassador, correctness nerd, and all around (mostly) lovable pedant on the subjects of software engineering and computer science.","location":"Everywhere"},{"name":"Nic Rosental","profilePic":"http://cfp.connect-js.com/system/avatars/168/large/banana-phone.png?1433532941","twitter":"nicdev","about":"","location":"Everywhere"},{"name":"Mike Schinkel","profilePic":"http://cfp.connect-js.com/system/avatars/314/large/mikeschinkel_240x240.jpg?1463261645","twitter":"mikeschinkel","about":"Mike is a life-long programmer and entrepreneur hailing from Georgia Tech who appreciates the marketshare gained by WordPress and thus specializes in using it as more of a development platform than just a CMS. Thus his team created the open-source project named WPLib which they position as \"The Developer Experience Project for WordPress.\"","location":"Everywhere"},{"name":"James Prolizo","profilePic":"http://cfp.connect-js.com/system/avatars/391/large/prolizo-headshot-casual.JPG?1467421414","twitter":"jprolizo","about":"Being an adopted son of Atlanta, James enjoys contributing back to the community through technology and philanthropy.  James is active in the mobile community as well as nonprofits such as TechBridge and Habitat for Humanity.","location":"Everywhere"},{"name":"Adam Paxton","profilePic":"http://cfp.connect-js.com/system/avatars/326/large/QGZ5Sc7F.jpeg?1468856594","twitter":"adampax","about":"Freelance mobile app developer with Polanco Media in sunny South Florida.  IOS, Android, Appcelerator Titanium","location":"Everywhere"},{"name":"Jason Kneen","profilePic":"http://cfp.connect-js.com/system/avatars/18/large/avatar2.JPG?1431971976","twitter":"jasonkneen","about":"Freelance Native Cross-Platform iOS, Android App Developer as @bouncingfish • Speaker • Author • Some DevRel for Appcelerator / Titanium","location":"Everywhere"},{"name":"Mark Mandel","profilePic":"http://cfp.connect-js.com/system/avatars/282/large/IMG_1550-4_Mark_sq.png?1438623417","twitter":"Neurotic","about":"Mark Mandel is a Developer Advocate for Google Cloud Platform and one half of the Google Cloud Platform Podcast. Hailing from Australia, Mark built his career developing backend systems for over 15 years and authoring and contributing to several widely adopted open source projects. When he’s not building infrastructure in the cloud, he’s constantly looking for new and interesting things he can do with Docker containers, playing with his dog and reading too much fantasy literature.","location":"Everywhere"},{"name":"Edwin Huertas","profilePic":"http://cfp.connect-js.com/system/avatars/86/large/IMG_1580.JPG?1408928455","twitter":"edwinRVA","about":"Taming the mobile monster @ http://Shockoe.com ","location":"Everywhere"},{"name":"Marlene Jaeckel","profilePic":"http://cfp.connect-js.com/system/avatars/354/large/EAeO23QM_400x400.png?1468858307","twitter":"@mjaeckel","about":"Marlene Jaeckel fell in love with software development during her first year at the University of Pretoria in South Africa, even though she was actually a business major. After moving to California in 2001, she worked on web applications and database systems until she decided to pursue her lifelong dream of a career in medicine. Along the way, however, she realized that her true passion lies in connecting technology and healthcare, which is why she now loves to work with wearables, sensors, and smart devices as a member of the mobile development team at Polyglot Programming. When she’s not coding, she’s often found in craft stores, doing genealogy research, or explaining the origins of her accent. (Hint: She’s so German that she loves both Hasselhoff and Heino.)    ","location":"Everywhere"},{"name":"James Majors","profilePic":"http://cfp.connect-js.com/system/avatars/370/large/empty_headshot.png?1468857847","twitter":"@noizetoys","about":"iOS developer at POSSIBLE Mobile. ","location":"Everywhere"},{"name":"James Majors","profilePic":"http://cfp.connect-js.com/system/avatars/370/large/empty_headshot.png?1468857847","twitter":"@noizetoys","about":"iOS developer at POSSIBLE Mobile. ","location":"Everywhere"},{"name":"Patrick Childers","profilePic":"http://cfp.connect-js.com/system/avatars/371/large/2da6e7b.jpg?1469904502","twitter":"ATLCTO","about":"","location":"Everywhere"},{"name":"Jon Friskics","profilePic":"http://cfp.connect-js.com/system/avatars/431/large/friskics-2014-full.jpg?1472831057","twitter":"@jonfriskics","about":"Jon Friskics an iOS developer from Orlando, Florida. He is the content director at Code School, an online learning platform that uses a combination of videos, slides, and interactive code challenges to help you learn by doing. There, he’s worked on courses such as App Evolution with Swift, Try iOS, Core iOS 7, and Try Objective-C – a free interactive primer for learning Objective-C.","location":"Everywhere"},{"name":"Han Solo","profilePic":"http://cfp.connect-js.com/system/avatars/8/large/han-solo-star-wars.jpg?1406386119","twitter":"OfficialHanSolo","about":"Captain, the Millennium Falcon","location":"Everywhere"},{"name":"Kristin Ottofy","profilePic":"http://cfp.connect-js.com/system/avatars/400/large/AAEAAQAAAAAAAAPNAAAAJDNjYmRjMDk4LWY4MDctNGY1MS1hMDNlLTRiNjQyNTYxMmUwMw.jpg?1468350551","twitter":"kristinottofy","about":"Kristin is a Technical Evangelist for Microsoft where she uses software development knowledge, technical writing and persuasive presentation skills to inspire students, startups, and developers to build innovative applications using Microsoft’s leading edge technology for a mobile first, cloud first world. She's a graduate from the University of Georgia where she received a Bachelor's in Computer Science and Master's in Mathematics Education. She taught high school Mathematics and Engineering before becoming a full-time developer and speaker. She mostly works on web applications, frequently in the education field, and is a big supporter of open source technology. ","location":"Everywhere"},{"name":"Stephen Schwahn","profilePic":"http://cfp.connect-js.com/system/avatars/341/large/IMG_5144.JPG?1469975052","twitter":"Dogstopper","about":"Stephen is a senior at Georgia Tech and the Chief Technical Officer at Plutonium Apps. He has cofounded a total of seven companies and has been playing with computers for more than 8 years. His hobbies include mountain biking, hiking, backpacking, and marching band.","location":"Everywhere"},{"name":"Anthony Jesmok","profilePic":"http://cfp.connect-js.com/system/avatars/402/large/headshot.png?1468328622","twitter":"anthonyjesmok","about":"Anthony is an experienced web and mobile developer based out of Milwaukee, Wisconsin. My work experience involves contributions to projects for startups, non-profit organizations, higher education, medical technologies, automotive, and other industries in the Milwaukee area, Chicago and beyond. He currently works for Misix, a growing marketing agency, and was previously with Google and a mobile development non-profit.","location":"Everywhere"},{"name":"Josh Backfield","profilePic":"http://cfp.connect-js.com/system/avatars/149/large/2yIuWys__400x400.jpg?1469930771","twitter":"@jbackfield","about":"Software engineer who lives on the edge of technology. Constantly looking for new technologies and concepts to apply to everyday programming. Yearns to help disseminate knowledge to others to improve the Computer Science landscape.","location":"Everywhere"},{"name":"David Hope","profilePic":"http://cfp.connect-js.com/system/avatars/406/large/360AnDevSpeakersPagePhotojpg.jpg?1468377890","twitter":"HopeDeveloper","about":"David is the Lead Android Engineer for Streetstop. He is an active member of the local Android community and Toastmasters International.","location":"Everywhere"},{"name":"Summers Pittman","profilePic":"http://cfp.connect-js.com/system/avatars/398/large/11750607_10101400417259509_7709314841840462154_n.jpg?1468166037","twitter":"summerspittman","about":"Summers is a Sr. Software Developer at Red Hat.  He lives in New Haven, CT.  While he lived in Atlanta he was active in the local developer community, AJUG, and DevNexus.","location":"Everywhere"},{"name":"Bolot Kerimbaev","profilePic":"http://cfp.connect-js.com/system/avatars/425/large/bolot_headshot_800.png?1470087835","twitter":"bolot","about":"Android and iOS Sensei at Big Nerd Ranch","location":"Everywhere"},{"name":"Shauvik Roy Choudhary","profilePic":"http://cfp.connect-js.com/system/avatars/418/large/shauvik_personal.jpg?1469726977","twitter":"shauvik","about":"Dr. Shauvik Roy Choudhary is the Founder of MoQuality, where he works on building cutting edge testing and support tools for mobile apps. He also works at FullStory where he builds security & engineering productivity tools. He received his PhD in Computer Science from Georgia Tech and his work was focused on techniques for cross-platform testing and maintenance for web and mobile applications. Prior to his PhD, Shauvik received his MS in Information Security from Georgia Tech and his BE in Computer Engineering from Mumbai University. Over the years, he has held several development, testing and research positions at companies including, Google, Fujitsu Labs of America, Yahoo! Inc., IBM Research, Goldman Sachs and HSBC Software. For more information about Shauvik, visit his website at http://shauvik.com","location":"Everywhere"},{"name":"Bryan Jones Richardson","profilePic":"http://cfp.connect-js.com/system/avatars/386/large/SK.Headshots.2015-8.jpg?1467313557","twitter":"@stablekernel","about":"Bryan Richardson is a native of Atlanta, Georgia. After graduating from Morehouse College with a degree in economics, he became interested in software development and currently works as an Android software engineer at stable|kernel, an Atlanta mobile app development company. He is passionate about coding and relishes creating robust, refined and exciting projects of the mobile industry. In his spare time, he enjoys gardening, reading, and listening to NPR.","location":"Everywhere"},{"name":"Jordan Kasper","profilePic":"http://cfp.connect-js.com/system/avatars/106/large/jordan_bw_large.jpg?1468351188","twitter":"jakerella","about":"Shortly after it arrived at his home in 1993, Jordan began disassembling his first computer - his mother was not happy. She breathed more easily when he moved from hardware into programming. Jordan's experience includes development at startups, agencies, Fortune 100 companies, and universities, as well as numerous open source projects. He has coded in many languages from BASIC to Java to PHP and most recently JavaScript and Node.js. He speaks regularly at (and helps organize) local user groups, conferences large and small, and hackathons. Jordan's primary mission for over 10 years has been to evangelize technology of all sorts and share what he has learned to help others grow. He is currently a front-end engineering instructor with The Iron Yard in Washington, DC. In his down time he enjoys puzzles of all sorts and board games!","location":"Everywhere"},{"name":"Stephen M. Carlson","profilePic":"http://cfp.connect-js.com/system/avatars/291/large/IMG_0332_cropped.jpg?1440557507","twitter":"xiinteractiv","about":"Full-stack Software Engineer obsessed with writing high quality, maintainable and extensible code. Agile evangelist, technology leader and entrepreneur.","location":"Everywhere"},{"name":"Stephen M. Carlson","profilePic":"http://cfp.connect-js.com/system/avatars/291/large/IMG_0332_cropped.jpg?1440557507","twitter":"xiinteractiv","about":"Full-stack Software Engineer obsessed with writing high quality, maintainable and extensible code. Agile evangelist, technology leader and entrepreneur.","location":"Everywhere"},{"name":"Tim Whitacre","profilePic":"http://cfp.connect-js.com/system/avatars/352/large/new_happy_500.png?1468520739","twitter":"timwco","about":"I've been living in ATL for a little over 2 years. I am the director of Front End Engineering at The Iron Yard Atlanta.","location":"Everywhere"},{"name":"Corinna Cohn","profilePic":"http://cfp.connect-js.com/system/avatars/307/large/T0EI7otn.jpg?1462828137","twitter":"corinna000","about":"Corinna Cohn has been creating websites since 1995 and has written web apps for radio stations, research projects, scientific publishing, and business-to-business clients. Over the past several years, Corinna has worked with Backbone, Ember, and Angular to design and write single-page applications. Corinna has written ugly, unmaintainable code but is now working to bring the principles of clean code, unit tests, and high-quality refactoring into the realm of JavaScript web application","location":"Everywhere"}]}
