{
  "profiles": [
    {
	  "id": "EricBobbitt",
      "name": "Eric Bobbitt",
      "profilePic": "https://avatars3.githubusercontent.com/u/19638?v=3",
      "twitter": "ericbobbitt",
      "about": "When he's not arguing semantics, dancing at all the wrong times, or drawing randomly on the office whiteboards, you'll find him working on the Ionic Platform, planning new features, and not-so-silently cursing at his laptop. Otherwise he's probably feeding his gaming addiction with a glass of whiskey or a good Belgian beer.",
      "location": "Madison, WI",
	  "matches":{
		  "ids":["ErfElie", "AdamBradley", "ZinedineZidane", "DavidBeckham"]
	  }
    },
    {
      "id": "AdamBradley",
	  "name": "Adam Bradley",
      "profilePic": "https://avatars2.githubusercontent.com/u/452425?v=3",
      "twitter": "adamdbradley",
      "about": "Co-creator of Ionic Framework and Angular Material Design team member. Regularly writes and speaks about hybrid development with Ionic and Angular. Proud dad, husband, veteran, and dog's best friend. Based in beautiful Madison, WI.",
      "location": "Madison, WI",
	  "matches":{
		  "ids":["ErfElie", "ZinedineZidane", "DavidBeckham"]
	  }
    },
    {
      "id": "BrandyCarney",
	  "name": "Brandy Carney",
      "profilePic": "https://avatars0.githubusercontent.com/u/6577830?v=3",
      "twitter": "brandyscarney",
      "about": "When she isn't busy keeping her two chihuahuas from killing each other, Brandy can be found making the Ionic SDK pretty by means of Sass. She loves helping people while continuing to expand her own knowledge. After hours she can be found on her patio shopping online with a glass of wine in hand. Give her a glass and she'll write some Sass.",
      "location": "Jacksonville, FL"
    },
    {
      "id": "KatieGinder-Vogel",
	  "name": "Katie Ginder-Vogel",
      "profilePic": "https://avatars2.githubusercontent.com/u/8117985?v=3",
      "twitter": "katiegv",
      "about": "Katie handles Ionic’s marketing, communications, and editorial, writing blog posts about unique Ionic apps and dreaming up new ways to bring Ionic to developers around the world. Outside the office, she can be found on land, running or hiking, or in the water, swimming and paddleboarding.",
      "location": "Madison, WI"
    },
    {
      "id": "PerryGovier",
	  "name": "Perry Govier",
      "profilePic": "https://avatars1.githubusercontent.com/u/571056?v=3",
      "twitter": "perrygovier",
      "about": "Be it code, places, gadgets, food, or conversation, Perry loves to explore. While AFK he's probably biking around Madison, spending time with his wife and son, \"refactoring\" his house, or avoiding his overweight cat to whom he is very allergic and wishes was a dog.",
      "location": "Madison, WI"
    },
    {
      "id": "MikeHartington",
	  "name": "Mike Hartington",
      "profilePic": "https://avatars0.githubusercontent.com/u/2835826?v=3",
      "twitter": "mhartington",
      "about": "Deep in the frozen North, just before the great wall, a man sits with a laptop, surrounded by serval cups of coffee and a glass of whiskey. Traveling across this great kingdom, he enlightens other devs and shares his knowledge through the written and spoken word. When the laptop is not near, he often finds solace in music with his guitar.",
      "location": "Rhode Island"
    },
    {
      "id": "DanImhoff",
	  "name": "Dan Imhoff",
      "profilePic": "https://pbs.twimg.com/profile_images/627907755743952896/TEEur1pK.jpg",
      "twitter": "dwieeb",
      "about": "Dan \"the Sunshine Man\" builds awesome stuff for the Ionic Platform. When not shredding it in Vim, he can be found tearing over snow in his fat bike, attending the Madison tech meetups, ignorantly rating restaurants, taking a bunch of photographs at random cities and National Parks, or, possibly, still playing LEGOs.",
      "location": "Madison, WI"
    },
    {
      "id": "BrodyKidd",
	  "name": "Brody Kidd",
      "profilePic": "https://avatars0.githubusercontent.com/u/5280265?v=3",
      "twitter": "brodymkidd",
      "about": "If you can’t find him on call, shuffling through email, poking around on a new CRM, in our live chat support, or white boarding new business development… Odds are he is surfing lake Michigan, fly fishing the gin clear streams of the driftless region, camping in the north woods, or milking his goats.",
      "location": "Madison, WI",
	  "matches":{
		  "ids":["ErfElie", "AdamBradley", "ZinedineZidane", "DavidBeckham"]
	  }
    },
    {
      "id": "TimLancina",
	  "name": "Tim Lancina",
      "profilePic": "https://avatars2.githubusercontent.com/u/804331?v=3",
      "twitter": "timlancina",
      "about": "A temporarily embarrassed pro soccer player, Tim is fond of traveling the world and trying to convince his coworkers to eat bugs.  When not doing either of those, he is usually breaking things related to Ionic tooling, the platform, or the framework.",
      "location": "Madison, WI"
    },
    {
      "id": "MaxLynch",
	  "name": "Max Lynch",
      "profilePic": "https://avatars3.githubusercontent.com/u/11214?v=3",
      "twitter": "maxlynch",
      "about": "Max loves using the power of software to make technology more accessible to people around the world. When not writing code or obsessing over a crazy new idea, he can be found watching the Premier League, riding Snowmobiles in a very safe manner, and hanging out with his wife Melissa and two Cavalier King Charles Spaniels.",
      "location": "Madison, WI"
    },
    {
      "id": "RudyPelrine",
	  "name": "Rudy Pelrine",
      "profilePic": "https://avatars0.githubusercontent.com/u/1584992?v=3",
      "twitter": "Drawn_Closer",
      "about": "A musician, DJ, sound engineer, photographer, and self proclaimed fashion nerd, Rudy seems to find a new obsession daily.  At Ionic, you'll find him working on the Platform services, making sure everyone's notifications arrive safe and sound.",
      "location": "Madison, WI"
    },
    {
      "id": "DrewRygh",
	  "name": "Drew Rygh",
      "profilePic": "https://avatars2.githubusercontent.com/u/2018508?v=3",
      "twitter": "ionicframework",
      "about": "On most days, you will find Drew devising dazzling demos, drafting documentation, and consuming copious quantities of caffeine. He is obsessed with clarity, and making Ionic easy and fun to use. When not working, you might find him walking around the UW-Madison campus, where he is studying philosophy and computer science.",
      "location": "Madison, WI"
    },
    {
      "id": "BenSperry",
	  "name": "Ben Sperry",
      "profilePic": "https://avatars1.githubusercontent.com/u/519526?v=3",
      "twitter": "benjsperry",
      "about": "Ben is a user interface designer and front end tinkerer based in Madison, WI. He’s fascinated with making delightful human and machine interactions. He is also the co-founder of Ionic.",
      "location": "Madison, WI",
	  "matches":{
		  "ids":["ErfElie", "AdamBradley", "ZinedineZidane", "DavidBeckham"]
	  }
    },
	{
		"id":"ErfElie",
		"name":"Erf Elie",
		"profilePic":"http://img4.hostingpics.net/pics/607497Meihm.jpg",
		"location":"Saint-Etienne, France",
		"matches":{
			"ids":["DavidBeckham", "ZinedineZidane", "EricBobbitt", "BenSperry"]
		}
	},
	{
		"id":"DavidBeckham",
		"name":"David Beckham",
		"profilePic":"https://lc.cx/4Auf",
		"tracks":["soccer","baseball","beach^^"],
		"location":"London, UK",
		"matches":{
			"ids":["EricBobbitt", "ErfElie", "ZinedineZidane", "BrodyKidd"]
		}
	},
	{
		"id":"ZinedineZidane",
		"name":"Zinedine Zidane",
		"profilePic":"https://lc.cx/4AuA",
		"tracks":["soccer","Real Madrid"],
		"location":"Madrid, Spain",
		"matches":{
			"ids":["BrodyKidd", "ErfElie", "BenSperry", "DavidBeckham"]
		}
	}
  ]
}